Q1. Create a table called employees with the following structure?
: emp_id (integer, should not be NULL and should be a primary key)Q
: emp_name (text, should not be NULL)Q
: age (integer, should have a check constraint to ensure the age is at least 18)
: email (text, should be unique for each employee)Q
: salary (decimal, with a default value of 30,000).

Write the SQL query to create the above table with all constraints.

In [ ]:
CREATE TABLE EMPLOYEE (
  empId INTEGER PRIMARY KEY,
  name TEXT NOT NULL,
  dept TEXT NOT NULL
);

INSERT INTO EMPLOYEE VALUES (0001, 'Clark', 'Sales');
INSERT INTO EMPLOYEE VALUES (0002, 'Dave', 'Accounting');
INSERT INTO EMPLOYEE VALUES (0003, 'Ava', 'Sales');

SELECT * FROM EMPLOYEE WHERE dept = 'Sales';

SyntaxError: leading zeros in decimal integer literals are not permitted; use an 0o prefix for octal integers (ipython-input-814521587.py, line 7)

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the EMPLOYEE table
cursor.execute("""
CREATE TABLE EMPLOYEE (
  empId INTEGER PRIMARY KEY,
  name TEXT NOT NULL,
  dept TEXT NOT NULL
);
""")

# Insert data into the EMPLOYEE table
cursor.execute("INSERT INTO EMPLOYEE VALUES (1, 'Clark', 'Sales');")
cursor.execute("INSERT INTO EMPLOYEE VALUES (2, 'Dave', 'Accounting');")
cursor.execute("INSERT INTO EMPLOYEE VALUES (3, 'Ava', 'Sales');")

# Select data from the EMPLOYEE table
cursor.execute("SELECT * FROM EMPLOYEE WHERE dept = 'Sales';")

# Fetch and display the results
results = cursor.fetchall()
for row in results:
    print(row)

# Close the connection
conn.close()

Q2. Explain the purpose of constraints and how they help maintain data integrity in a database. Provide
examples of common types of constraints.

**Ans.**

**Purpose of Constraints in a Database**

Constraints are rules applied to database columns to enforce data integrity, accuracy, and reliability. They ensure that the data entered into a table follows specific rules and relationships, preventing invalid or inconsistent data.

How Constraints Help Maintain Data Integrity

**Prevent Invalid Data Entry**
Example: A CHECK (age >= 18) constraint stops users from entering an underage value.

**Ensure Uniqueness**
Example: An email column with a UNIQUE constraint ensures no two employees share the same email.

**Maintain Consistency Across Tables**
Example: A FOREIGN KEY ensures that a value in one table corresponds to a value in another table (e.g., department IDs).

**Protect Critical Data**
Example: A NOT NULL constraint ensures important fields (like names or IDs) are never left empty.

**Automatically Apply Defaults**
Example: DEFAULT 30000 for a salary ensures that even if the value is not provided, it gets a reasonable default.

| Constraint Type | Description                                                          | Example                                           |
| --------------- | -------------------------------------------------------------------- | ------------------------------------------------- |
| **PRIMARY KEY** | Uniquely identifies each row in a table. Cannot be NULL.             | `emp_id INTEGER PRIMARY KEY`                      |
| **NOT NULL**    | Ensures a column cannot have a NULL value.                           | `emp_name TEXT NOT NULL`                          |
| **UNIQUE**      | Ensures all values in a column are different.                        | `email TEXT UNIQUE`                               |
| **CHECK**       | Validates that values meet a specific condition.                     | `age INTEGER CHECK (age >= 18)`                   |
| **DEFAULT**     | Assigns a default value if none is provided.                         | `salary DECIMAL DEFAULT 30000`                    |
| **FOREIGN KEY** | Ensures values match keys in another table (enforces relationships). | `dept_id INTEGER REFERENCES departments(dept_id)` |

Q3. Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify
your answer.

**Ans.** The NOT NULL constraint ensures that a column must always have a value — it cannot be left empty.

**Reasons to Use NOT NULL:**

**Data Integrity**
It guarantees that essential information is always provided (e.g., names, IDs, prices).

**Avoid Ambiguity**
NULL represents "unknown" or "missing" data, which can lead to confusion in queries, calculations, or reports.

**Enforce Business Rules**
For example, every employee must have a name — so emp_name TEXT NOT NULL.

**Prevent Application Errors**
Many apps expect certain fields to always contain data. Nulls can cause runtime errors if not handled properly.

Q4.  Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an
example for both adding and removing a constraint.

**Ans.**

Adding and Removing Constraints on an Existing Table

In SQL, modifying constraints on an existing table involves using the ALTER TABLE command. However, the exact capabilities and syntax vary depending on the database system (e.g., SQLite, PostgreSQL, MySQL, SQL Server).

- **Add a Constraint**

General Syntax:

ALTER TABLE table_name
ADD CONSTRAINT constraint_name constraint_type (column_name);

**Remove (Drop) a Constraint**

General Syntax (most SQL dialects):

ALTER TABLE table_name
DROP CONSTRAINT constraint_name;

Q5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints.
Provide an example of an error message that might occur when violating a constraint.

**Ans.**

**Consequences of Violating Constraints in SQL**

When you try to INSERT, UPDATE, or DELETE data that violates a constraint, the Database Management System (DBMS) will reject the operation and throw an error message. This ensures data integrity is maintained.

Here’s what happens for different types of constraints:

**PRIMARY KEY constraint**

If you try to insert a duplicate value into a primary key column → Error: duplicate key.

If you insert NULL in a primary key column → Error: cannot insert NULL.

**FOREIGN KEY constraint**

If you insert a value that does not exist in the referenced table → Error: foreign key violation.

If you try to delete a parent row that is referenced by a child row → Error: constraint violation.

**UNIQUE constraint**

If you insert/update with a value that already exists in a column that must be unique → Error: duplicate value.

**CHECK constraint**

If you insert/update a value that does not satisfy the condition → Error: check constraint violation.

**NOT NULL constraint**

If you insert/update a NULL value into a column defined as NOT NULL → Error: cannot insert NULL.

Q6. You created a products table without constraints as follows:

CREATE TABLE products (

    product_id INT,

    product_name VARCHAR(50),

    price DECIMAL(10, 2));
Now, you realise that?
: The product_id should be a primary keyQ
: The price should have a default value of 50.00

In [ ]:
CREATE TABLE products (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(50),
    price DECIMAL(10, 2) DEFAULT 50.00
);

SyntaxError: invalid syntax (ipython-input-4269538985.py, line 1)

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
# You can replace ':memory:' with a database file path if you want to save the data
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the products table with constraints
cursor.execute("""
CREATE TABLE products (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(50),
    price DECIMAL(10, 2) DEFAULT 50.00
);
""")

print("Products table created successfully with constraints.")

# Close the connection
conn.close()

Products table created successfully with constraints.

Q7. You have two tables:
Write a query to fetch the student_name and class_name for each student using an INNER JOIN.

In [ ]:
SELECT
    Students.student_name,
    Classes.class_name
FROM
    Students
INNER JOIN
    Classes
ON
    Students.class_id = Classes.class_id;

IndentationError: unexpected indent (ipython-input-2079155790.py, line 2)

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create Students table
cursor.execute("""
CREATE TABLE Students (
    student_id INTEGER PRIMARY KEY,
    student_name TEXT NOT NULL,
    class_id INTEGER
);
""")

# Create Classes table
cursor.execute("""
CREATE TABLE Classes (
    class_id INTEGER PRIMARY KEY,
    class_name TEXT NOT NULL
);
""")

# Insert sample data into Students
cursor.execute("INSERT INTO Students VALUES (1, 'Alice', 101);")
cursor.execute("INSERT INTO Students VALUES (2, 'Bob', 102);")
cursor.execute("INSERT INTO Students VALUES (3, 'Charlie', 101);")
cursor.execute("INSERT INTO Students VALUES (4, 'David', 103);")


# Insert sample data into Classes
cursor.execute("INSERT INTO Classes VALUES (101, 'Math');")
cursor.execute("INSERT INTO Classes VALUES (102, 'Science');")
cursor.execute("INSERT INTO Classes VALUES (103, 'History');")


# Execute the INNER JOIN query
cursor.execute("""
SELECT
    Students.student_name,
    Classes.class_name
FROM
    Students
INNER JOIN
    Classes
ON
    Students.class_id = Classes.class_id;
""")

# Fetch and display the results
results = cursor.fetchall()
for row in results:
    print(row)

# Close the connection
conn.close()

Q8. Consider the following three tables:
Write a query that shows all order_id, customer_name, and product_name, ensuring that all products are
listed even if they are not associated with an order

Hint: (use INNER JOIN and LEFT JOIN)5

In [ ]:
SELECT
    Products.order_id,
    Customers.customer_name,
    Products.product_name
FROM
    Products
LEFT JOIN
    Orders ON Products.order_id = Orders.order_id
LEFT JOIN
    Customers ON Orders.customer_id = Customers.customer_id;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create Customers table
cursor.execute("""
CREATE TABLE Customers (
    customer_id INTEGER PRIMARY KEY,
    customer_name TEXT NOT NULL
);
""")

# Create Orders table
cursor.execute("""
CREATE TABLE Orders (
    order_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    FOREIGN KEY (customer_id) REFERENCES Customers(customer_id)
);
""")

# Create Products table
cursor.execute("""
CREATE TABLE Products (
    product_id INTEGER PRIMARY KEY,
    product_name TEXT NOT NULL,
    order_id INTEGER,
    FOREIGN KEY (order_id) REFERENCES Orders(order_id)
);
""")

# Insert sample data into Customers
cursor.execute("INSERT INTO Customers VALUES (1, 'Alice');")
cursor.execute("INSERT INTO Customers VALUES (2, 'Bob');")

# Insert sample data into Orders
cursor.execute("INSERT INTO Orders VALUES (101, 1);")
cursor.execute("INSERT INTO Orders VALUES (102, 2);")
cursor.execute("INSERT INTO Orders VALUES (103, 1);")


# Insert sample data into Products
cursor.execute("INSERT INTO Products VALUES (1001, 'Laptop', 101);")
cursor.execute("INSERT INTO Products VALUES (1002, 'Mouse', 101);")
cursor.execute("INSERT INTO Products VALUES (1003, 'Keyboard', 102);")
cursor.execute("INSERT INTO Products VALUES (1004, 'Monitor', NULL);") # Product not in an order


# Execute the LEFT JOIN query
cursor.execute("""
SELECT
    P.order_id,
    C.customer_name,
    P.product_name
FROM
    Products AS P
LEFT JOIN
    Orders AS O ON P.order_id = O.order_id
LEFT JOIN
    Customers AS C ON O.customer_id = C.customer_id;
""")


# Fetch and display the results
results = cursor.fetchall()
for row in results:
    print(row)

# Close the connection
conn.close()

Q9. Given the following tables:

Write a query to find the total sales amount for each product using an INNER JOIN and the SUM() function.

In [ ]:
SELECT
    Products.product_name,
    SUM(Sales.amount) AS total_sales
FROM
    Sales
INNER JOIN
    Products ON Sales.product_id = Products.product_id
GROUP BY
    Products.product_name;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create Products table
cursor.execute("""
CREATE TABLE Products (
    product_id INTEGER PRIMARY KEY,
    product_name TEXT NOT NULL
);
""")

# Create Sales table
cursor.execute("""
CREATE TABLE Sales (
    sale_id INTEGER PRIMARY KEY,
    product_id INTEGER,
    amount DECIMAL(10, 2),
    FOREIGN KEY (product_id) REFERENCES Products(product_id)
);
""")

# Insert sample data into Products
cursor.execute("INSERT INTO Products VALUES (1, 'Laptop');")
cursor.execute("INSERT INTO Products VALUES (2, 'Mouse');")
cursor.execute("INSERT INTO Products VALUES (3, 'Keyboard');")


# Insert sample data into Sales
cursor.execute("INSERT INTO Sales VALUES (101, 1, 1200.00);")
cursor.execute("INSERT INTO Sales VALUES (102, 2, 25.00);")
cursor.execute("INSERT INTO Sales VALUES (103, 1, 150.00);") # Another sale for Laptop
cursor.execute("INSERT INTO Sales VALUES (104, 3, 75.00);")
cursor.execute("INSERT INTO Sales VALUES (105, 2, 10.00);") # Another sale for Mouse


# Execute the INNER JOIN query with SUM()
cursor.execute("""
SELECT
    P.product_name,
    SUM(S.amount) AS total_sales
FROM
    Sales AS S
INNER JOIN
    Products AS P ON S.product_id = P.product_id
GROUP BY
    P.product_name;
""")


# Fetch and display the results
results = cursor.fetchall()
for row in results:
    print(row)

# Close the connection
conn.close()

**Q10. You are given three tables:**
Write a query to display the order_id, customer_name, and the quantity of products ordered by each
customer using an INNER JOIN between all three tables.

In [33]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE Customers (
    customer_id INTEGER PRIMARY KEY,
    customer_name TEXT NOT NULL
);
""")

cursor.execute("""
CREATE TABLE Orders (
    order_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    FOREIGN KEY (customer_id) REFERENCES Customers(customer_id)
);
""")

cursor.execute("""
CREATE TABLE Order_Details (
    order_detail_id INTEGER PRIMARY KEY,
    order_id INTEGER,
    product_id INTEGER,
    quantity INTEGER NOT NULL,
    FOREIGN KEY (order_id) REFERENCES Orders(order_id)
    -- FOREIGN KEY (product_id) REFERENCES Products(product_id) -- Products table not needed for this query
);
""")

# Insert sample data into Customers
cursor.execute("INSERT INTO Customers VALUES (1, 'Alice');")
cursor.execute("INSERT INTO Customers VALUES (2, 'Bob');")

# Insert sample data into Orders
cursor.execute("INSERT INTO Orders VALUES (101, 1);") # Alice's order
cursor.execute("INSERT INTO Orders VALUES (102, 2);") # Bob's order
cursor.execute("INSERT INTO Orders VALUES (103, 1);") # Alice's another order


# Insert sample data into Order_Details
cursor.execute("INSERT INTO Order_Details VALUES (1001, 101, 1, 2);") # 2 of product 1 in order 101
cursor.execute("INSERT INTO Order_Details VALUES (1002, 101, 2, 1);") # 1 of product 2 in order 101
cursor.execute("INSERT INTO Order_Details VALUES (1003, 102, 3, 5);") # 5 of product 3 in order 102
cursor.execute("INSERT INTO Order_Details VALUES (1004, 103, 1, 3);") # 3 of product 1 in order 103


# Write a query to display order_id, customer_name, and quantity
cursor.execute("""
SELECT
    o.order_id,
    c.customer_name,
    od.quantity
FROM Orders o
INNER JOIN Customers c
    ON o.customer_id = c.customer_id
INNER JOIN Order_Details od
    ON o.order_id = od.order_id;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Order details with customer names and quantities:")
    for row in results:
        print(row)
else:
    print("No order details found.")

# Close the connection
conn.close()

Order details with customer names and quantities:
(101, 'Alice', 2)
(101, 'Alice', 1)
(102, 'Bob', 5)
(103, 'Alice', 3)

##SQL Commands

**Q1. Identify the primary keys and foreign keys in maven movies db. Discuss the differences.**

**Ans.**

In the Maven Movies database, primary keys are the unique identifiers for each row in a table, while foreign keys connect tables to establish relationships between them.

**Primary Keys in Maven Movies DB**
Examples include:

- customer_id in the Customers table

- film_id in the Film table

- rental_id in the Rental table

- store_id in the Store table

Each of these columns has unique values and cannot contain NULLs, ensuring every row is identifiable.

**Foreign Keys in Maven Movies DB**
Examples include:

- customer_id in the Rental table, referencing Customers

- inventory_id in the Rental table, referencing Inventory

- film_id in the Inventory table, referencing Film

- staff_id in the Payment table, referencing Staff

- Foreign keys allow tables to reference the primary key columns in other tables, maintaining referential integrity between related data.

**Differences Between Primary Key and Foreign Key**

| Feature        | Primary Key (PK)                          | Foreign Key (FK)                                                  |
| -------------- | ----------------------------------------- | ----------------------------------------------------------------- |
| **Uniqueness** | Always unique; identifies a row           | Can have duplicates; points to PK in another table                |
| **Nulls**      | Cannot be NULL                            | Can be NULL (depends on DB design)                                |
| **Purpose**    | Identifies a record in its own table      | Enforces relationship between tables                              |
| **Example**    | `film.film_id` uniquely identifies a film | `inventory.film_id` tells which film an inventory item belongs to |

**Common Primary & Foreign Keys in Maven Movies DB**

| Table           | Primary Key                         | Foreign Keys                                                   |
| --------------- | ----------------------------------- | -------------------------------------------------------------- |
| `actor`         | `actor_id`                          | —                                                              |
| `film`          | `film_id`                           | `language_id`, `original_language_id` → `language.language_id` |
| `film_actor`    | (`film_id`, `actor_id`) (composite) | `film_id` → `film`, `actor_id` → `actor`                       |
| `category`      | `category_id`                       | —                                                              |
| `film_category` | (`film_id`, `category_id`)          | `film_id` → `film`, `category_id` → `category`                 |
| `customer`      | `customer_id`                       | `store_id` → `store`, `address_id` → `address`                 |
| `rental`        | `rental_id`                         | `inventory_id` → `inventory`, `customer_id`, `staff_id`        |
| `payment`       | `payment_id`                        | `customer_id`, `rental_id`, `staff_id`                         |
| `inventory`     | `inventory_id`                      | `film_id`, `store_id`                                          |
| `staff`         | `staff_id`                          | `address_id`, `store_id`                                       |

In [ ]:
CREATE TABLE actor (
    actor_id INT PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    last_update TIMESTAMP
);

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the actor table
cursor.execute("""
CREATE TABLE actor (
    actor_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    last_update TIMESTAMP
);
""")

print("Actor table created successfully.")

# Close the connection
conn.close()

**Q2.  List all details of actors.**

In [ ]:
SELECT *
FROM actor;

In [ ]:
import sqlite3

# Connect to the in-memory SQLite database
# This assumes the actor table was created in a previous in-memory session
# If not, you would need to recreate the table and potentially insert data first.
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Note: If the actor table was not created in this specific in-memory session,
# the following query will fail. For this example, we'll assume it was,
# or you would need to add table creation and data insertion here.

# Execute the SELECT query
cursor.execute("SELECT * FROM actor;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Details of actors:")
    for row in results:
        print(row)
else:
    print("No actors found or table not created in this session.")


# Close the connection
conn.close()

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the actor table
cursor.execute("""
CREATE TABLE actor (
    actor_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    last_update TIMESTAMP
);
""")

# Insert some sample data (since the table is empty in a new connection)
cursor.execute("INSERT INTO actor VALUES (1, 'Penelope', 'Guiness', '2006-02-15 04:34:33');")
cursor.execute("INSERT INTO actor VALUES (2, 'Nick', 'Wahlberg', '2006-02-15 04:34:33');")
cursor.execute("INSERT INTO actor VALUES (3, 'Ed', 'Chase', '2006-02-15 04:34:33');")


print("Actor table created and sample data inserted.")

# Execute the SELECT query
cursor.execute("SELECT * FROM actor;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Details of actors:")
    for row in results:
        print(row)
else:
    print("No actors found.")


# Close the connection
conn.close()

**Q3. List all customer information from DB.**

In [ ]:
SELECT *
FROM customer;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the customer table
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    email VARCHAR(100) UNIQUE,
    address_id INTEGER
);
""")

# Insert some sample data
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5);")
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', 6);")
cursor.execute("INSERT INTO customer VALUES (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7);")


print("Customer table created and sample data inserted.")

# Execute the SELECT query
cursor.execute("SELECT * FROM customer;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Details of customers:")
    for row in results:
        print(row)
else:
    print("No customers found.")

# Close the connection
conn.close()

**4. List different countries.**

In [ ]:
SELECT DISTINCT country
FROM country;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the country table
cursor.execute("""
CREATE TABLE country (
    country_id INTEGER PRIMARY KEY,
    country TEXT NOT NULL
);
""")

# Insert some sample data
cursor.execute("INSERT INTO country VALUES (1, 'Canada');")
cursor.execute("INSERT INTO country VALUES (2, 'Mexico');")
cursor.execute("INSERT INTO country VALUES (3, 'Canada');") # Duplicate country to test DISTINCT
cursor.execute("INSERT INTO country VALUES (4, 'USA');")


print("Country table created and sample data inserted.")

# Execute the SELECT DISTINCT query
cursor.execute("SELECT DISTINCT country FROM country;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Different countries:")
    for row in results:
        print(row[0]) # Access the country name from the tuple
else:
    print("No countries found.")

# Close the connection
conn.close()

**Q5. Display all active customers.**

In [ ]:
SELECT *
FROM customer
WHERE active = 1;

SyntaxError: invalid syntax (ipython-input-1844075125.py, line 1)

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the customer table with an active column
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    email VARCHAR(100) UNIQUE,
    address_id INTEGER,
    active INTEGER -- Added active column
);
""")

# Insert some sample data (including active status)
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5, 1);") # Active
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', 6, 0);") # Not active
cursor.execute("INSERT INTO customer VALUES (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7, 1);") # Active


print("Customer table created with active column and sample data inserted.")

# Execute the SELECT query for active customers
cursor.execute("SELECT * FROM customer WHERE active = 1;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Details of active customers:")
    for row in results:
        print(row)
else:
    print("No active customers found.")

# Close the connection
conn.close()

**Q6. List of all rental IDs for customer with ID 1.**

In [ ]:
SELECT rental_id
FROM rental
WHERE customer_id = 1;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create Customer table (needed for foreign key in rental)
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
);
""")

# Create Rental table
cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    FOREIGN KEY (customer_id) REFERENCES customer(customer_id)
);
""")

# Insert sample data into Customer
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith');")
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson');")


# Insert sample data into Rental
cursor.execute("INSERT INTO rental VALUES (100, 1);") # Rental for customer 1
cursor.execute("INSERT INTO rental VALUES (101, 2);") # Rental for customer 2
cursor.execute("INSERT INTO rental VALUES (102, 1);") # Another rental for customer 1
cursor.execute("INSERT INTO rental VALUES (103, 1);") # Another rental for customer 1


print("Customer and Rental tables created and sample data inserted.")

# Execute the SELECT query for rental IDs of customer with ID 1
cursor.execute("SELECT rental_id FROM rental WHERE customer_id = 1;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Rental IDs for customer with ID 1:")
    for row in results:
        print(row[0]) # Access the rental_id from the tuple
else:
    print("No rentals found for customer with ID 1.")

# Close the connection
conn.close()

Customer and Rental tables created and sample data inserted.
Rental IDs for customer with ID 1:
100
102
103

**Q7. Display all the films whose rental duration is greater than 5 .**

In [ ]:
SELECT *
FROM film
WHERE rental_duration > 5;

SyntaxError: invalid syntax (ipython-input-3516839707.py, line 1)

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the film table with rental_duration
cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    rental_duration INTEGER
);
""")

# Insert some sample data
cursor.execute("INSERT INTO film VALUES (1, 'Film A', 3);")
cursor.execute("INSERT INTO film VALUES (2, 'Film B', 7);")
cursor.execute("INSERT INTO film VALUES (3, 'Film C', 5);")
cursor.execute("INSERT INTO film VALUES (4, 'Film D', 8);")


print("Film table created and sample data inserted.")

# Execute the SELECT query for films with rental duration > 5
cursor.execute("SELECT * FROM film WHERE rental_duration > 5;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Films with rental duration greater than 5:")
    for row in results:
        print(row)
else:
    print("No films found with rental duration greater than 5.")

# Close the connection
conn.close()

**Q8. List the total number of films whose replacement cost is greater than $15 and less than $20.**

In [ ]:
SELECT COUNT(*) AS total_films
FROM film
WHERE replacement_cost > 15 AND replacement_cost < 20;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the film table with replacement_cost
cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    replacement_cost DECIMAL(5, 2)
);
""")

# Insert some sample data
cursor.execute("INSERT INTO film VALUES (1, 'Film A', 10.00);") # Cost < 15
cursor.execute("INSERT INTO film VALUES (2, 'Film B', 16.50);") # Cost between 15 and 20
cursor.execute("INSERT INTO film VALUES (3, 'Film C', 25.00);") # Cost > 20
cursor.execute("INSERT INTO film VALUES (4, 'Film D', 18.75);") # Cost between 15 and 20


print("Film table created with replacement_cost and sample data inserted.")

# Execute the COUNT query
cursor.execute("SELECT COUNT(*) AS total_films FROM film WHERE replacement_cost > 15 AND replacement_cost < 20;")

# Fetch and display the results
results = cursor.fetchone() # Use fetchone() for a single result


if results:
    print(f"Total number of films with replacement cost between $15 and $20: {results[0]}")
else:
    print("Could not retrieve count.")

# Close the connection
conn.close()

**Q9 Display the count of unique first names of actors.**

In [ ]:
SELECT COUNT(DISTINCT first_name) AS unique_first_names_count
FROM actor;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the actor table
cursor.execute("""
CREATE TABLE actor (
    actor_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    last_update TIMESTAMP
);
""")

# Insert some sample data (including a duplicate first name)
cursor.execute("INSERT INTO actor VALUES (1, 'Penelope', 'Guiness', '2006-02-15 04:34:33');")
cursor.execute("INSERT INTO actor VALUES (2, 'Nick', 'Wahlberg', '2006-02-15 04:34:33');")
cursor.execute("INSERT INTO actor VALUES (3, 'Ed', 'Chase', '2006-02-15 04:34:33');")
cursor.execute("INSERT INTO actor VALUES (4, 'Penelope', 'Cruz', '2006-02-15 04:34:33');") # Duplicate first name


print("Actor table created and sample data inserted.")

# Execute the COUNT(DISTINCT first_name) query
cursor.execute("SELECT COUNT(DISTINCT first_name) AS unique_first_names_count FROM actor;")

# Fetch and display the results
results = cursor.fetchone() # Use fetchone() for a single result


if results:
    print(f"Count of unique first names: {results[0]}")
else:
    print("Could not retrieve count.")

# Close the connection
conn.close()

**Q10- Display the first 10 records from the customer table.**

In [ ]:
SELECT *
FROM customer
LIMIT 10;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the customer table
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    email VARCHAR(100) UNIQUE,
    address_id INTEGER
);
""")

# Insert more than 10 sample data records
sample_customers = [
    (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5),
    (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', 6),
    (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7),
    (4, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', 8),
    (5, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', 9),
    (6, 'Jennifer', 'Davis', 'jennifer.davis@sakilacustomer.org', 10),
    (7, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', 11),
    (8, 'Susan', 'Wilson', 'susan.wilson@sakilacustomer.org', 12),
    (9, 'Margaret', 'Moore', 'margaret.moore@sakilacustomer.org', 13),
    (10, 'Dorothy', 'Taylor', 'dorothy.taylor@sakilacustomer.org', 14),
    (11, 'Lisa', 'Anderson', 'lisa.anderson@sakilacustomer.org', 15),
    (12, 'Nancy', 'Thomas', 'nancy.thomas@sakilacustomer.org', 16),
]

cursor.executemany("INSERT INTO customer VALUES (?, ?, ?, ?, ?);", sample_customers)


print("Customer table created and sample data inserted.")

# Execute the SELECT query with LIMIT 10
cursor.execute("SELECT * FROM customer LIMIT 10;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("First 10 records from the customer table:")
    for row in results:
        print(row)
else:
    print("No customers found.")

# Close the connection
conn.close()

**Q11 - Display the first 3 records from the customer table whose first name starts with ‘b’.**

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'b%'
LIMIT 3;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the customer table
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    email VARCHAR(100) UNIQUE,
    address_id INTEGER
);
""")

# Insert sample data (including names starting with 'b')
sample_customers = [
    (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5),
    (2, 'Barbara', 'Johnson', 'barbara.johnson@sakilacustomer.org', 6),
    (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7),
    (4, 'Betty', 'Jones', 'betty.jones@sakilacustomer.org', 8),
    (5, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', 9),
    (6, 'Brian', 'Davis', 'brian.davis@sakilacustomer.org', 10),
    (7, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', 11),
    (8, 'Susan', 'Wilson', 'susan.wilson@sakilacustomer.org', 12),
]

cursor.executemany("INSERT INTO customer VALUES (?, ?, ?, ?, ?);", sample_customers)


print("Customer table created and sample data inserted.")

# Execute the SELECT query with WHERE and LIMIT
cursor.execute("SELECT * FROM customer WHERE first_name LIKE 'B%' LIMIT 3;") # Use 'B%' for case-insensitive like

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("First 3 records from the customer table whose first name starts with 'B':")
    for row in results:
        print(row)
else:
    print("No customers found whose first name starts with 'B'.")

# Close the connection
conn.close()

**Q12 -Display the names of the first 5 movies which are rated as ‘G’.**

In [ ]:
SELECT title
FROM film
WHERE rating = 'G'
LIMIT 5;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the film table with rating
cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    rating VARCHAR(10)
);
""")

# Insert some sample data
cursor.execute("INSERT INTO film VALUES (1, 'Movie A', 'G');")
cursor.execute("INSERT INTO film VALUES (2, 'Movie B', 'PG');")
cursor.execute("INSERT INTO film VALUES (3, 'Movie C', 'G');")
cursor.execute("INSERT INTO film VALUES (4, 'Movie D', 'R');")
cursor.execute("INSERT INTO film VALUES (5, 'Movie E', 'G');")
cursor.execute("INSERT INTO film VALUES (6, 'Movie F', 'G');") # Another G rated movie
cursor.execute("INSERT INTO film VALUES (7, 'Movie G', 'G');") # Another G rated movie
cursor.execute("INSERT INTO film VALUES (8, 'Movie H', 'PG-13');")


print("Film table created with rating and sample data inserted.")

# Execute the SELECT query for G rated films with LIMIT 5
cursor.execute("SELECT title FROM film WHERE rating = 'G' LIMIT 5;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("First 5 movies rated as 'G':")
    for row in results:
        print(row[0]) # Access the title from the tuple
else:
    print("No G rated movies found.")

# Close the connection
conn.close()

**Q13-Find all customers whose first name starts with "a".**

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'a%';

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the customer table
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    email VARCHAR(100) UNIQUE,
    address_id INTEGER
);
""")

# Insert sample data (including names starting with 'a')
sample_customers = [
    (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5),
    (2, 'Alice', 'Johnson', 'alice.johnson@sakilacustomer.org', 6),
    (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7),
    (4, 'Amanda', 'Jones', 'amanda.jones@sakilacustomer.org', 8),
    (5, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', 9),
    (6, 'Andrew', 'Davis', 'andrew.davis@sakilacustomer.org', 10),
    (7, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', 11),
    (8, 'Susan', 'Wilson', 'susan.wilson@sakilacustomer.org', 12),
]

cursor.executemany("INSERT INTO customer VALUES (?, ?, ?, ?, ?);", sample_customers)


print("Customer table created and sample data inserted.")

# Execute the SELECT query with WHERE
cursor.execute("SELECT * FROM customer WHERE first_name LIKE 'A%';") # Use 'A%' for case-insensitive like

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customers whose first name starts with 'A':")
    for row in results:
        print(row)
else:
    print("No customers found whose first name starts with 'A'.")

# Close the connection
conn.close()

**Q14- Find all customers whose first name ends with "a".**

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '%a';

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the customer table
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    email VARCHAR(100) UNIQUE,
    address_id INTEGER
);
""")

# Insert sample data (including names ending with 'a')
sample_customers = [
    (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5),
    (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', 6),
    (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7),
    (4, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', 8),
    (5, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', 9),
    (6, 'Laura', 'Davis', 'laura.davis@sakilacustomer.org', 10),
    (7, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', 11),
    (8, 'Susan', 'Wilson', 'susan.wilson@sakilacustomer.org', 12),
    (9, 'Amanda', 'Taylor', 'amanda.taylor@sakilacustomer.org', 13),
]

cursor.executemany("INSERT INTO customer VALUES (?, ?, ?, ?, ?);", sample_customers)


print("Customer table created and sample data inserted.")

# Execute the SELECT query with WHERE
cursor.execute("SELECT * FROM customer WHERE first_name LIKE '%a';")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customers whose first name ends with 'a':")
    for row in results:
        print(row)
else:
    print("No customers found whose first name ends with 'a'.")

# Close the connection
conn.close()

**Q15- Display the list of first 4 cities which start and end with 'a'.**

In [ ]:
SELECT city
FROM city
WHERE city LIKE 'a%' AND city LIKE '%a'
LIMIT 4;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the city table
cursor.execute("""
CREATE TABLE city (
    city_id INTEGER PRIMARY KEY,
    city TEXT NOT NULL
);
""")

# Insert some sample data
cursor.execute("INSERT INTO city VALUES (1, 'Acton');")
cursor.execute("INSERT INTO city VALUES (2, 'London');")
cursor.execute("INSERT INTO city VALUES (3, 'Atlanta');")
cursor.execute("INSERT INTO city VALUES (4, 'Alabama');")
cursor.execute("INSERT INTO city VALUES (5, 'Paris');")
cursor.execute("INSERT INTO city VALUES (6, 'Aurora');")


print("City table created and sample data inserted.")

# Execute the SELECT query
cursor.execute("SELECT city FROM city WHERE city LIKE 'a%' AND city LIKE '%a' LIMIT 4;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("First 4 cities that start and end with 'a':")
    for row in results:
        print(row[0]) # Access the city name from the tuple
else:
    print("No cities found that start and end with 'a'.")

# Close the connection
conn.close()

**Q16- Find all customers whose first name have "NI" in any position.**

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '%NI%';

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the customer table
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    email VARCHAR(100) UNIQUE,
    address_id INTEGER
);
""")

# Insert sample data (including names with "NI")
sample_customers = [
    (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5),
    (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', 6),
    (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7),
    (4, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', 8),
    (5, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', 9),
    (6, 'Nicole', 'Davis', 'nicole.davis@sakilacustomer.org', 10),
    (7, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', 11),
    (8, 'Dennis', 'Wilson', 'dennis.wilson@sakilacustomer.org', 12),
    (9, 'Christine', 'Taylor', 'christine.taylor@sakilacustomer.org', 13),
]

cursor.executemany("INSERT INTO customer VALUES (?, ?, ?, ?, ?);", sample_customers)


print("Customer table created and sample data inserted.")

# Execute the SELECT query with WHERE
cursor.execute("SELECT * FROM customer WHERE first_name LIKE '%NI%';")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customers whose first name contains 'NI':")
    for row in results:
        print(row)
else:
    print("No customers found whose first name contains 'NI'.")

# Close the connection
conn.close()

Customer table created and sample data inserted.
Customers whose first name contains 'NI':
(6, 'Nicole', 'Davis', 'nicole.davis@sakilacustomer.org', 10)
(8, 'Dennis', 'Wilson', 'dennis.wilson@sakilacustomer.org', 12)

**Q17- Find all customers whose first name have "r" in the second position.**

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE '_r%';

SyntaxError: invalid syntax (ipython-input-1372733534.py, line 1)

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the customer table
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    email VARCHAR(100) UNIQUE,
    address_id INTEGER
);
""")

# Insert sample data (including names with 'r' in the second position)
sample_customers = [
    (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5),
    (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', 6),
    (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7),
    (4, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', 8),
    (5, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', 9),
    (6, 'Robert', 'Davis', 'robert.davis@sakilacustomer.org', 10),
    (7, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', 11),
    (8, 'Susan', 'Wilson', 'susan.wilson@sakilacustomer.org', 12),
    (9, 'Frank', 'Taylor', 'frank.taylor@sakilacustomer.org', 13), # 'r' in second position
    (10, 'Grace', 'Moore', 'grace.moore@sakilacustomer.org', 14), # 'r' in second position

]

cursor.executemany("INSERT INTO customer VALUES (?, ?, ?, ?, ?);", sample_customers)


print("Customer table created and sample data inserted.")

# Execute the SELECT query with WHERE
cursor.execute("SELECT * FROM customer WHERE first_name LIKE '_r%';")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customers whose first name has 'r' in the second position:")
    for row in results:
        print(row)
else:
    print("No customers found whose first name has 'r' in the second position.")

# Close the connection
conn.close()

**Q18 - Find all customers whose first name starts with "a" and are at least 5 characters in length.**

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'a%'
  AND LENGTH(first_name) >= 5;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the customer table
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    email VARCHAR(100) UNIQUE,
    address_id INTEGER
);
""")

# Insert sample data (including names starting with 'a' and different lengths)
sample_customers = [
    (1, 'Amy', 'Smith', 'amy.smith@sakilacustomer.org', 5),   # Starts with a, length 3
    (2, 'Alice', 'Johnson', 'alice.johnson@sakilacustomer.org', 6), # Starts with a, length 5
    (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7),
    (4, 'Amanda', 'Jones', 'amanda.jones@sakilacustomer.org', 8), # Starts with a, length 6
    (5, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', 9),
    (6, 'Andrew', 'Davis', 'andrew.davis@sakilacustomer.org', 10), # Starts with a, length 6
    (7, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', 11),
    (8, 'Susan', 'Wilson', 'susan.wilson@sakilacustomer.org', 12),
    (9, 'Ann', 'Taylor', 'ann.taylor@sakilacustomer.org', 13),     # Starts with a, length 3
]

cursor.executemany("INSERT INTO customer VALUES (?, ?, ?, ?, ?);", sample_customers)


print("Customer table created and sample data inserted.")

# Execute the SELECT query with WHERE
cursor.execute("SELECT * FROM customer WHERE first_name LIKE 'A%' AND LENGTH(first_name) >= 5;") # Use 'A%' for case-insensitive like

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customers whose first name starts with 'A' and are at least 5 characters long:")
    for row in results:
        print(row)
else:
    print("No customers found whose first name starts with 'A' and are at least 5 characters long.")

# Close the connection
conn.close()

**Q19 Find all customers whose first name starts with "a" and ends with "o"**

In [ ]:
SELECT *
FROM customer
WHERE first_name LIKE 'a%o';

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the customer table
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    email VARCHAR(100) UNIQUE,
    address_id INTEGER
);
""")

# Insert sample data (including names that start with 'a' and end with 'o')
sample_customers = [
    (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5),
    (2, 'Alice', 'Johnson', 'alice.johnson@sakilacustomer.org', 6),
    (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7),
    (4, 'Amanda', 'Jones', 'amanda.jones@sakilacustomer.org', 8),
    (5, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', 9),
    (6, 'Antonio', 'Davis', 'antonio.davis@sakilacustomer.org', 10), # Starts with a, ends with o
    (7, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', 11),
    (8, 'Alberto', 'Wilson', 'alberto.wilson@sakilacustomer.org', 12), # Starts with a, ends with o
    (9, 'Susan', 'Taylor', 'susan.taylor@sakilacustomer.org', 13),
]

cursor.executemany("INSERT INTO customer VALUES (?, ?, ?, ?, ?);", sample_customers)


print("Customer table created and sample data inserted.")

# Execute the SELECT query with WHERE
cursor.execute("SELECT * FROM customer WHERE first_name LIKE 'A%o';") # Use 'A%o' for case-insensitive like

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customers whose first name starts with 'A' and ends with 'o':")
    for row in results:
        print(row)
else:
    print("No customers found whose first name starts with 'A' and ends with 'o'.")

# Close the connection
conn.close()

**Q20 - Get the films with pg and pg-13 rating using IN operator.**

In [ ]:
SELECT *
FROM film
WHERE rating IN ('PG', 'PG-13');

SyntaxError: invalid syntax (ipython-input-255100850.py, line 1)

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the film table with rating
cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    rating VARCHAR(10)
);
""")

# Insert some sample data
cursor.execute("INSERT INTO film VALUES (1, 'Movie A', 'G');")
cursor.execute("INSERT INTO film VALUES (2, 'Movie B', 'PG');")
cursor.execute("INSERT INTO film VALUES (3, 'Movie C', 'G');")
cursor.execute("INSERT INTO film VALUES (4, 'Movie D', 'R');")
cursor.execute("INSERT INTO film VALUES (5, 'Movie E', 'G');")
cursor.execute("INSERT INTO film VALUES (6, 'Movie F', 'PG-13');") # PG-13 rated movie
cursor.execute("INSERT INTO film VALUES (7, 'Movie G', 'G');")
cursor.execute("INSERT INTO film VALUES (8, 'Movie H', 'PG-13');") # Another PG-13 rated movie


print("Film table created with rating and sample data inserted.")

# Execute the SELECT query for PG and PG-13 rated films
cursor.execute("SELECT * FROM film WHERE rating IN ('PG', 'PG-13');")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Films with 'PG' or 'PG-13' rating:")
    for row in results:
        print(row)
else:
    print("No films found with 'PG' or 'PG-13' rating.")

# Close the connection
conn.close()

**Q21 - Get the films with length between 50 to 100 using between operator.**

In [ ]:
SELECT *
FROM film
WHERE length BETWEEN 50 AND 100;

SyntaxError: invalid syntax (ipython-input-4175513269.py, line 1)

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the film table with length
cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    length INTEGER
);
""")

# Insert some sample data
cursor.execute("INSERT INTO film VALUES (1, 'Film A', 45);") # Length < 50
cursor.execute("INSERT INTO film VALUES (2, 'Film B', 75);") # Length between 50 and 100
cursor.execute("INSERT INTO film VALUES (3, 'Film C', 110);") # Length > 100
cursor.execute("INSERT INTO film VALUES (4, 'Film D', 90);") # Length between 50 and 100


print("Film table created with length and sample data inserted.")

# Execute the SELECT query for films with length between 50 and 100
cursor.execute("SELECT * FROM film WHERE length BETWEEN 50 AND 100;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Films with length between 50 and 100:")
    for row in results:
        print(row)
else:
    print("No films found with length between 50 and 100.")

# Close the connection
conn.close()

**Q22 - Get the top 50 actors using limit operator.**

In [ ]:
SELECT TOP 50 *
FROM actor;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the actor table
cursor.execute("""
CREATE TABLE actor (
    actor_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    last_update TIMESTAMP
);
""")

# Insert some sample data (more than 50 records if you want to see the LIMIT take effect,
# but for this example, I'll insert a few)
sample_actors = [
    (1, 'Penelope', 'Guiness', '2006-02-15 04:34:33'),
    (2, 'Nick', 'Wahlberg', '2006-02-15 04:34:33'),
    (3, 'Ed', 'Chase', '2006-02-15 04:34:33'),
    (4, 'Jennifer', 'Davis', '2006-02-15 04:34:33'),
    (5, 'Johnny', 'Lollobrigida', '2006-02-15 04:34:33'),
    (6, 'Bette', 'Davis', '2006-02-15 04:34:33'),
    (7, 'Grace', 'Mostel', '2006-02-15 04:34:33'),
    (8, 'Matthew', 'Johansson', '2006-02-15 04:34:33'),
    (9, 'Joe', 'Swank', '2006-02-15 04:34:33'),
    (10, 'Christian', 'Gable', '2006-02-15 04:34:33'),
]
cursor.executemany("INSERT INTO actor VALUES (?, ?, ?, ?);", sample_actors)


print("Actor table created and sample data inserted.")

# Execute the SELECT query with LIMIT 50
# SQLite uses LIMIT, not TOP
cursor.execute("SELECT * FROM actor LIMIT 50;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("First 50 records from the actor table:")
    for row in results:
        print(row)
else:
    print("No actors found.")


# Close the connection
conn.close()

**Q23 - Get the distinct film ids from inventory table.**

In [ ]:
SELECT DISTINCT film_id
FROM inventory;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the inventory table
cursor.execute("""
CREATE TABLE inventory (
    inventory_id INTEGER PRIMARY KEY,
    film_id INTEGER,
    store_id INTEGER
);
""")

# Insert some sample data (including duplicate film_ids)
cursor.execute("INSERT INTO inventory VALUES (1, 101, 1);")
cursor.execute("INSERT INTO inventory VALUES (2, 102, 1);")
cursor.execute("INSERT INTO inventory VALUES (3, 101, 2);") # Duplicate film_id
cursor.execute("INSERT INTO inventory VALUES (4, 103, 1);")
cursor.execute("INSERT INTO inventory VALUES (5, 102, 2);") # Duplicate film_id


print("Inventory table created and sample data inserted.")

# Execute the SELECT DISTINCT query
cursor.execute("SELECT DISTINCT film_id FROM inventory;")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Distinct film IDs from inventory:")
    for row in results:
        print(row[0]) # Access the film_id from the tuple
else:
    print("No film IDs found in inventory.")

# Close the connection
conn.close()

#Functions

##Basic Aggregate Functions:

**Question 1:**

Retrieve the total number of rentals made in the Sakila database.

Hint: Use the COUNT() function.

In [ ]:
-- Use the Sakila database
USE sakila;

-- Get the total number of rentals
SELECT
    COUNT(*) AS total_rentals
FROM
    rental;

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy rental table and insert some data for demonstration
cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date DATE NOT NULL,
    inventory_id INTEGER NOT NULL,
    customer_id INTEGER NOT NULL,
    return_date DATE,
    staff_id INTEGER NOT NULL
);
""")

cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27', 101, 1, '2023-11-01', 1);")
cursor.execute("INSERT INTO rental VALUES (2, '2023-10-28', 102, 2, '2023-11-05', 1);")
cursor.execute("INSERT INTO rental VALUES (3, '2023-10-28', 103, 1, '2023-11-04', 2);")
cursor.execute("INSERT INTO rental VALUES (4, '2023-10-29', 101, 3, '2023-11-06', 1);")


# Execute the SQL query to get the total number of rentals
cursor.execute("SELECT COUNT(*) AS total_rentals FROM rental;")

# Fetch and display the result
total_rentals = cursor.fetchone()[0]
print(f"Total number of rentals: {total_rentals}")

# Close the connection
conn.close()

Total number of rentals: 4

**Question 2:**

Calculate the average rental duration of films in the Sakila database.

Hint: Use the AVG() function.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy film table with rental_duration
cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    rental_duration INTEGER
);
""")

# Insert some sample data
cursor.execute("INSERT INTO film VALUES (1, 'Film A', 3);")
cursor.execute("INSERT INTO film VALUES (2, 'Film B', 7);")
cursor.execute("INSERT INTO film VALUES (3, 'Film C', 5);")
cursor.execute("INSERT INTO film VALUES (4, 'Film D', 8);")


# Execute the SQL query to calculate the average rental duration
cursor.execute("SELECT AVG(rental_duration) AS average_rental_duration FROM film;")

# Fetch and display the result
average_duration = cursor.fetchone()[0]
print(f"Average rental duration: {average_duration}")

# Close the connection
conn.close()

Average rental duration: 5.75

**Question 3:**
String Functions:

Display the first name and last name of customers in uppercase.

Hint: Use the UPPER () function.

In [ ]:
USE sakila;

SELECT
    UPPER(first_name) AS first_name_upper,
    UPPER(last_name) AS last_name_upper
FROM
    customer;

SyntaxError: invalid syntax (ipython-input-1453329998.py, line 1)

**Question 4:**

Extract the month from the rental date and display it alongside the rental ID.

Hint: Employ the MONTH() function.

In [35]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy rental table with sample data
cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date TEXT NOT NULL -- Use TEXT for date strings in SQLite
);
""")

# Insert some sample data with date strings
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27');")
cursor.execute("INSERT INTO rental VALUES (2, '2023-11-15');")
cursor.execute("INSERT INTO rental VALUES (3, '2024-01-05');")
cursor.execute("INSERT INTO rental VALUES (4, '2023-03-20');")


# Execute the SQL query to extract the month from rental_date
cursor.execute("""
SELECT
    rental_id,
    strftime('%m', rental_date) AS rental_month
FROM
    rental
ORDER BY rental_id;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Rental IDs and their corresponding months:")
    for row in results:
        print(row)
else:
    print("No rentals found.")

# Close the connection
conn.close()

Rental IDs and their corresponding months:
(1, '10')
(2, '11')
(3, '01')
(4, '03')

##String Functions

**Question 1:**

Retrieve the total number of rentals made in the Sakila database.

Hint: Use the COUNT() function..

In [ ]:
-- Count all rental records
SELECT
    COUNT(*) AS total_rentals
FROM
    rental;

SyntaxError: invalid syntax (ipython-input-1479895949.py, line 1)

In [ ]:
import sqlite3

# Connect to the in-memory SQLite database
# This assumes the database connection from loading the schema and data is still open.
# If not, you would need to re-establish the connection here.
# conn = sqlite3.connect(':memory:') # Uncomment and run if the connection was closed
# cursor = conn.cursor() # Uncomment and run if the connection was closed

# Execute the SQL query to get the total number of rentals
cursor.execute("SELECT COUNT(*) AS total_rentals FROM rental;")

# Fetch and display the result
total_rentals = cursor.fetchone()[0]
print(f"Total number of rentals: {total_rentals}")

# Note: We are not closing the connection here so that the database remains
# available for subsequent queries in the same notebook session.
# conn.close() # Uncomment and run if you want to close the connection

OperationalError: no such table: rental

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
# You can replace ':memory:' with a database file path if you want to save the database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Read the SQL schema file
try:
    with open('/content/sakila-schema.sql', 'r') as f:
        sql_schema = f.read()

    # Execute the SQL schema script
    cursor.executescript(sql_schema)

    print("Sakila database schema loaded successfully!")

except FileNotFoundError:
    print("Error: sakila-schema.sql not found. Please make sure the file is uploaded to /content/.")
except Exception as e:
    print(f"An error occurred: {e}")
# Note: We are not closing the connection here so that the database remains
# available for subsequent queries in the same notebook session.
# conn.close()

An error occurred: near "SET": syntax error

In [ ]:
import sqlite3

# Connect to the in-memory SQLite database
# This assumes the database connection from loading the schema is still open.
# If not, you would need to re-establish the connection here.
# conn = sqlite3.connect(':memory:') # Uncomment and run if the connection was closed
# cursor = conn.cursor() # Uncomment and run if the connection was closed

# Read the SQL data file
try:
    with open('/content/sakila-data.sql', 'r') as f:
        sql_data = f.read()

    # Execute the SQL data script
    # Use `executescript` for multiple SQL statements in the file
    cursor.executescript(sql_data)

    print("Sakila database data loaded successfully!")

except FileNotFoundError:
    print("Error: sakila-data.sql not found. Please make sure the file is uploaded to /content/.")
except Exception as e:
    print(f"An error occurred: {e}")
# Note: We are not closing the connection here so that the database remains
# available for subsequent queries in the same notebook session.
# conn.close() # Uncomment and run if you want to close the connection

An error occurred: near "SET": syntax error

**Question 2:**

Find the average rental duration (in days) of movies rented from the Sakila database.

Hint: Utilize the AVG() function.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy rental table with rental_date and return_date
cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date TEXT NOT NULL, -- Use TEXT for date strings in SQLite
    return_date TEXT -- Use TEXT for date strings in SQLite
);
""")

# Insert some sample data with date strings
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27', '2023-11-01');") # Duration 5 days
cursor.execute("INSERT INTO rental VALUES (2, '2023-11-15', '2023-11-22');") # Duration 7 days
cursor.execute("INSERT INTO rental VALUES (3, '2024-01-05', '2024-01-10');") # Duration 5 days
cursor.execute("INSERT INTO rental VALUES (4, '2024-03-20', '2024-03-28');") # Duration 8 days
cursor.execute("INSERT INTO rental VALUES (5, '2023-12-01', NULL);") # Still rented


# Execute the SQL query to calculate the average rental duration in days for completed rentals
cursor.execute("""
SELECT
    AVG(JULIANDAY(return_date) - JULIANDAY(rental_date)) AS average_rental_duration
FROM
    rental
WHERE
    return_date IS NOT NULL; -- Only consider completed rentals
""")

# Fetch and display the result
average_duration = cursor.fetchone()[0]
print(f"Average rental duration (in days) for completed rentals: {average_duration}")

# Close the connection
conn.close()

Average rental duration (in days) for completed rentals: 6.25

String Functions:

**Question 3:**

Display the first name and last name of customers in uppercase.

Hint: Use the UPPER () function.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy customer table with sample data
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
);
""")

# Insert some sample data
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith');")
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson');")
cursor.execute("INSERT INTO customer VALUES (3, 'Linda', 'Williams');")


# Execute the SQL query to display first and last names in uppercase
cursor.execute("""
SELECT
    UPPER(first_name) AS first_name_upper,
    UPPER(last_name) AS last_name_upper
FROM
    customer;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customer names in uppercase:")
    for row in results:
        print(row)
else:
    print("No customers found.")

# Close the connection
conn.close()

Customer names in uppercase:
('MARY', 'SMITH')
('PATRICIA', 'JOHNSON')
('LINDA', 'WILLIAMS')

**Question 4:**

Extract the month from the rental date and display it alongside the rental ID.

Hint: Employ the MONTH() function.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy rental table with sample data
cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date TEXT NOT NULL -- Use TEXT for date strings in SQLite
);
""")

# Insert some sample data with date strings
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27');")
cursor.execute("INSERT INTO rental VALUES (2, '2023-11-15');")
cursor.execute("INSERT INTO rental VALUES (3, '2024-01-05');")
cursor.execute("INSERT INTO rental VALUES (4, '2024-03-20');")


# Execute the SQL query to extract the month from rental_date
cursor.execute("""
SELECT
    rental_id,
    strftime('%m', rental_date) AS rental_month
FROM
    rental;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Rental IDs and their corresponding months:")
    for row in results:
        print(row)
else:
    print("No rentals found.")

# Close the connection
conn.close()

Rental IDs and their corresponding months:
(1, '10')
(2, '11')
(3, '01')
(4, '03')

GROUP BY:

**Question 5:**

Retrieve the count of rentals for each customer (display customer ID and the count of rentals).

Hint: Use COUNT () in conjunction with GROUP BY.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy rental table and insert some data for demonstration
cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    customer_id INTEGER NOT NULL,
    rental_date DATE
);
""")

# Insert some sample data with varying customer_ids
cursor.execute("INSERT INTO rental VALUES (1, 1, '2023-10-27');")
cursor.execute("INSERT INTO rental VALUES (2, 2, '2023-10-28');")
cursor.execute("INSERT INTO rental VALUES (3, 1, '2023-10-28');") # Another rental for customer 1
cursor.execute("INSERT INTO rental VALUES (4, 3, '2023-10-29');")
cursor.execute("INSERT INTO rental VALUES (5, 2, '2023-10-29');") # Another rental for customer 2


# Execute the SQL query to get the count of rentals for each customer
cursor.execute("""
SELECT
    customer_id,
    COUNT(*) AS rental_count
FROM
    rental
GROUP BY
    customer_id;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Rental counts per customer:")
    for row in results:
        print(row)
else:
    print("No rentals found.")

# Close the connection
conn.close()

Rental counts per customer:
(1, 2)
(2, 2)
(3, 1)

**Question 6:**

Find the total revenue generated by each store.

Hint: Combine SUM() and GROUP BY.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE store (
    store_id INTEGER PRIMARY KEY
);
""")

cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    store_id INTEGER,
    FOREIGN KEY (store_id) REFERENCES store(store_id)
);
""")

cursor.execute("""
CREATE TABLE payment (
    payment_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    amount DECIMAL(10, 2),
    FOREIGN KEY (customer_id) REFERENCES customer(customer_id)
);
""")

# Insert sample data into store
cursor.execute("INSERT INTO store VALUES (1);")
cursor.execute("INSERT INTO store VALUES (2);")

# Insert sample data into customer (linking customers to stores)
cursor.execute("INSERT INTO customer VALUES (101, 1);") # Customer 101 from Store 1
cursor.execute("INSERT INTO customer VALUES (102, 1);") # Customer 102 from Store 1
cursor.execute("INSERT INTO customer VALUES (103, 2);") # Customer 103 from Store 2

# Insert sample data into payment (linking payments to customers)
cursor.execute("INSERT INTO payment VALUES (1, 101, 10.50);")
cursor.execute("INSERT INTO payment VALUES (2, 102, 20.00);")
cursor.execute("INSERT INTO payment VALUES (3, 101, 5.75);") # Another payment for customer 101
cursor.execute("INSERT INTO payment VALUES (4, 103, 15.00);")
cursor.execute("INSERT INTO payment VALUES (5, 103, 8.20);") # Another payment for customer 103


# Execute the SQL query to find the total revenue generated by each store
cursor.execute("""
SELECT
    s.store_id,
    SUM(p.amount) AS total_revenue
FROM
    payment p
JOIN
    customer c ON p.customer_id = c.customer_id
JOIN
    store s ON c.store_id = s.store_id
GROUP BY
    s.store_id;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Total revenue per store:")
    for row in results:
        print(row)
else:
    print("No revenue data found.")

# Close the connection
conn.close()

Total revenue per store:
(1, 36.25)
(2, 23.2)

**Question 7:**

Determine the total number of rentals for each category of movies.

Hint: JOIN film_category, film, and rental tables, then use cOUNT () and GROUP BY.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE category (
    category_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL
);
""")

cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL
    -- Add other film columns if needed for realism
);
""")

cursor.execute("""
CREATE TABLE film_category (
    film_id INTEGER,
    category_id INTEGER,
    PRIMARY KEY (film_id, category_id),
    FOREIGN KEY (film_id) REFERENCES film(film_id),
    FOREIGN KEY (category_id) REFERENCES category(category_id)
);
""")

cursor.execute("""
CREATE TABLE inventory (
    inventory_id INTEGER PRIMARY KEY,
    film_id INTEGER,
    store_id INTEGER,
    FOREIGN KEY (film_id) REFERENCES film(film_id)
    -- Add other inventory columns
);
""")

cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date DATE,
    inventory_id INTEGER,
    customer_id INTEGER,
    staff_id INTEGER,
    FOREIGN KEY (inventory_id) REFERENCES inventory(inventory_id)
    -- Add other rental columns
);
""")

# Insert sample data into category
cursor.execute("INSERT INTO category VALUES (1, 'Action');")
cursor.execute("INSERT INTO category VALUES (2, 'Comedy');")
cursor.execute("INSERT INTO category VALUES (3, 'Drama');")


# Insert sample data into film
cursor.execute("INSERT INTO film VALUES (101, 'Film A');") # Action, Comedy
cursor.execute("INSERT INTO film VALUES (102, 'Film B');") # Comedy, Drama
cursor.execute("INSERT INTO film VALUES (103, 'Film C');") # Action


# Insert sample data into film_category
cursor.execute("INSERT INTO film_category VALUES (101, 1);") # Film A is Action
cursor.execute("INSERT INTO film_category VALUES (101, 2);") # Film A is Comedy
cursor.execute("INSERT INTO film_category VALUES (102, 2);") # Film B is Comedy
cursor.execute("INSERT INTO film_category VALUES (102, 3);") # Film B is Drama
cursor.execute("INSERT INTO film_category VALUES (103, 1);") # Film C is Action


# Insert sample data into inventory
cursor.execute("INSERT INTO inventory VALUES (1001, 101, 1);") # Film A in inventory
cursor.execute("INSERT INTO inventory VALUES (1002, 102, 1);") # Film B in inventory
cursor.execute("INSERT INTO inventory VALUES (1003, 101, 2);") # Film A in another inventory


# Insert sample data into rental
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27', 1001, 1, 1);") # Rental for Film A (Action, Comedy)
cursor.execute("INSERT INTO rental VALUES (2, '2023-10-28', 1002, 2, 1);") # Rental for Film B (Comedy, Drama)
cursor.execute("INSERT INTO rental VALUES (3, '2023-10-28', 1001, 3, 2);") # Another rental for Film A (Action, Comedy)


# Execute the SQL query to get total rentals for each movie category
cursor.execute("""
SELECT
    c.name AS category_name,
    COUNT(r.rental_id) AS total_rentals
FROM
    category c
JOIN
    film_category fc ON c.category_id = fc.category_id
JOIN
    film f ON fc.film_id = f.film_id
JOIN
    inventory i ON f.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    c.name
ORDER BY
    total_rentals DESC;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Total rentals per category:")
    for row in results:
        print(row)
else:
    print("No rental data found for categories.")

# Close the connection
conn.close()

Total rentals per category:
('Comedy', 3)
('Action', 2)
('Drama', 1)

**Question 8:**

Find the average rental rate of movies in each language.

Hint: JOIN film and language tables, then use AVG () and GROUP BY.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE language (
    language_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL
);
""")

cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    language_id INTEGER,
    rental_rate DECIMAL(4, 2),
    FOREIGN KEY (language_id) REFERENCES language(language_id)
);
""")

# Insert sample data into language
cursor.execute("INSERT INTO language VALUES (1, 'English');")
cursor.execute("INSERT INTO language VALUES (2, 'Italian');")
cursor.execute("INSERT INTO language VALUES (3, 'French');")


# Insert sample data into film
cursor.execute("INSERT INTO film VALUES (101, 'Film A', 1, 2.99);") # English
cursor.execute("INSERT INTO film VALUES (102, 'Film B', 2, 0.99);") # Italian
cursor.execute("INSERT INTO film VALUES (103, 'Film C', 1, 4.99);") # English
cursor.execute("INSERT INTO film VALUES (104, 'Film D', 3, 1.99);") # French
cursor.execute("INSERT INTO film VALUES (105, 'Film E', 1, 3.99);") # English


# Execute the SQL query to find the average rental rate of movies in each language
cursor.execute("""
SELECT
    l.name AS language,
    AVG(f.rental_rate) AS average_rental_rate
FROM
    film f
JOIN
    language l ON f.language_id = l.language_id
GROUP BY
    l.name
ORDER BY
    average_rental_rate DESC;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Average rental rate per language:")
    for row in results:
        print(row)
else:
    print("No film data found.")

# Close the connection
conn.close()

Average rental rate per language:
('English', 3.99)
('French', 1.99)
('Italian', 0.99)

**Questions 9 -**

Display the title of the movie, customer s first name, and last name who rented it.

Hint: Use JOIN between the film, inventory, rental, and customer tables.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
    -- Add other customer columns if needed
);
""")

cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL
    -- Add other film columns if needed
);
""")

cursor.execute("""
CREATE TABLE inventory (
    inventory_id INTEGER PRIMARY KEY,
    film_id INTEGER,
    store_id INTEGER,
    FOREIGN KEY (film_id) REFERENCES film(film_id)
    -- Add other inventory columns
);
""")

cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date DATE,
    inventory_id INTEGER,
    customer_id INTEGER,
    staff_id INTEGER,
    FOREIGN KEY (inventory_id) REFERENCES inventory(inventory_id),
    FOREIGN KEY (customer_id) REFERENCES customer(customer_id)
    -- Add other rental columns
);
""")

# Insert sample data into customer
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith');")
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson');")


# Insert sample data into film
cursor.execute("INSERT INTO film VALUES (101, 'Film A');")
cursor.execute("INSERT INTO film VALUES (102, 'Film B');")


# Insert sample data into inventory
cursor.execute("INSERT INTO inventory VALUES (1001, 101, 1);") # Film A in inventory
cursor.execute("INSERT INTO inventory VALUES (1002, 102, 1);") # Film B in inventory
cursor.execute("INSERT INTO inventory VALUES (1003, 101, 2);") # Film A in another inventory


# Insert sample data into rental
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27', 1001, 1, 1);") # Rental for Film A by Mary Smith
cursor.execute("INSERT INTO rental VALUES (2, '2023-10-28', 1002, 2, 1);") # Rental for Film B by Patricia Johnson
cursor.execute("INSERT INTO rental VALUES (3, '2023-10-28', 1001, 1, 2);") # Another rental for Film A by Mary Smith


# Execute the SQL query to display movie title and customer name for each rental
cursor.execute("""
SELECT
    f.title AS movie_title,
    c.first_name,
    c.last_name
FROM
    rental r
JOIN
    inventory i ON r.inventory_id = i.inventory_id
JOIN
    film f ON i.film_id = f.film_id
JOIN
    customer c ON r.customer_id = c.customer_id
ORDER BY
    f.title, c.last_name;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Movie rentals and customer names:")
    for row in results:
        print(row)
else:
    print("No rentals found.")

# Close the connection
conn.close()

Movie rentals and customer names:
('Film A', 'Mary', 'Smith')
('Film A', 'Mary', 'Smith')
('Film B', 'Patricia', 'Johnson')

**Question 10:**

Retrieve the names of all actors who have appeared in the film "Gone with the Wind."

Hint: Use JOIN between the film actor, film, and actor tables.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE actor (
    actor_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
    -- Add other actor columns if needed
);
""")

cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL
    -- Add other film columns if needed
);
""")

cursor.execute("""
CREATE TABLE film_actor (
    actor_id INTEGER,
    film_id INTEGER,
    PRIMARY KEY (actor_id, film_id),
    FOREIGN KEY (actor_id) REFERENCES actor(actor_id),
    FOREIGN KEY (film_id) REFERENCES film(film_id)
);
""")

# Insert sample data into actor
cursor.execute("INSERT INTO actor VALUES (1, 'Penelope', 'Guiness');")
cursor.execute("INSERT INTO actor VALUES (2, 'Nick', 'Wahlberg');")
cursor.execute("INSERT INTO actor VALUES (3, 'Ed', 'Chase');")
cursor.execute("INSERT INTO actor VALUES (4, 'Jennifer', 'Davis');")


# Insert sample data into film
cursor.execute("INSERT INTO film VALUES (101, 'Film A');")
cursor.execute("INSERT INTO film VALUES (102, 'Gone with the Wind');") # The target film
cursor.execute("INSERT INTO film VALUES (103, 'Film C');")


# Insert sample data into film_actor (linking actors to films)
cursor.execute("INSERT INTO film_actor VALUES (1, 101);") # Penelope in Film A
cursor.execute("INSERT INTO film_actor VALUES (2, 102);") # Nick in Gone with the Wind
cursor.execute("INSERT INTO film_actor VALUES (3, 101);") # Ed in Film A
cursor.execute("INSERT INTO film_actor VALUES (4, 102);") # Jennifer in Gone with the Wind
cursor.execute("INSERT INTO film_actor VALUES (1, 102);") # Penelope also in Gone with the Wind


# Execute the SQL query to find actors in "Gone with the Wind"
cursor.execute("""
SELECT
    a.first_name,
    a.last_name
FROM
    film f
JOIN
    film_actor fa ON f.film_id = fa.film_id
JOIN
    actor a ON fa.actor_id = a.actor_id
WHERE
    f.title = 'Gone with the Wind';
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Actors in 'Gone with the Wind':")
    for row in results:
        print(row)
else:
    print("No actors found for 'Gone with the Wind' or film not in data.")

# Close the connection
conn.close()

Actors in 'Gone with the Wind':
('Nick', 'Wahlberg')
('Jennifer', 'Davis')
('Penelope', 'Guiness')

**Question 11:**

Retrieve the customer names along with the total amount they've spent on rentals.

Hint: JOIN customer, payment, and rental tables, then use SUM() and GROUP BY.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
    -- Add other customer columns if needed
);
""")

cursor.execute("""
CREATE TABLE payment (
    payment_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    amount DECIMAL(10, 2),
    FOREIGN KEY (customer_id) REFERENCES customer(customer_id)
);
""")

# Insert sample data into customer
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith');")
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson');")
cursor.execute("INSERT INTO customer VALUES (3, 'Linda', 'Williams');")


# Insert sample data into payment
cursor.execute("INSERT INTO payment VALUES (1, 1, 10.50);") # Payment by Mary
cursor.execute("INSERT INTO payment VALUES (2, 2, 20.00);") # Payment by Patricia
cursor.execute("INSERT INTO payment VALUES (3, 1, 5.75);")  # Another payment by Mary
cursor.execute("INSERT INTO payment VALUES (4, 3, 15.00);") # Payment by Linda
cursor.execute("INSERT INTO payment VALUES (5, 2, 8.20);")  # Another payment by Patricia


# Retrieve customer names along with the total amount they've spent on rentals
cursor.execute("""
SELECT
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_spent
FROM
    customer c
JOIN
    payment p ON c.customer_id = p.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    total_spent DESC;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customer total spending:")
    for row in results:
        print(row)
else:
    print("No payment data found.")

# Close the connection
conn.close()

Customer total spending:
('Patricia', 'Johnson', 28.2)
('Mary', 'Smith', 16.25)
('Linda', 'Williams', 15)

**Question 12:**

List the titles of movies rented by each customer in a particular city (e.g., 'London').

Hint: JOIN customer, address, city, rental, inventory, and film tables, then use GROUP BY.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    address_id INTEGER,
    FOREIGN KEY (address_id) REFERENCES address(address_id)
    -- Add other customer columns if needed
);
""")

cursor.execute("""
CREATE TABLE address (
    address_id INTEGER PRIMARY KEY,
    address TEXT,
    city_id INTEGER,
    FOREIGN KEY (city_id) REFERENCES city(city_id)
    -- Add other address columns if needed
);
""")

cursor.execute("""
CREATE TABLE city (
    city_id INTEGER PRIMARY KEY,
    city TEXT NOT NULL
    -- Add other city columns if needed
);
""")

cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL
    -- Add other film columns if needed
);
""")

cursor.execute("""
CREATE TABLE inventory (
    inventory_id INTEGER PRIMARY KEY,
    film_id INTEGER,
    store_id INTEGER,
    FOREIGN KEY (film_id) REFERENCES film(film_id)
    -- Add other inventory columns
);
""")

cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date DATE,
    inventory_id INTEGER,
    customer_id INTEGER,
    staff_id INTEGER,
    FOREIGN KEY (inventory_id) REFERENCES inventory(inventory_id),
    FOREIGN KEY (customer_id) REFERENCES customer(customer_id)
    -- Add other rental columns
);
""")


# Insert sample data into city
cursor.execute("INSERT INTO city VALUES (1, 'London');")
cursor.execute("INSERT INTO city VALUES (2, 'Paris');")


# Insert sample data into address (linking addresses to cities)
cursor.execute("INSERT INTO address VALUES (101, '123 Main St', 1);") # London address
cursor.execute("INSERT INTO address VALUES (102, '456 Oak Ave', 1);") # London address
cursor.execute("INSERT INTO address VALUES (103, '789 Pine Ln', 2);") # Paris address


# Insert sample data into customer (linking customers to addresses)
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith', 101);") # Mary in London
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson', 102);") # Patricia in London
cursor.execute("INSERT INTO customer VALUES (3, 'Linda', 'Williams', 103);") # Linda in Paris


# Insert sample data into film
cursor.execute("INSERT INTO film VALUES (1001, 'Film A');")
cursor.execute("INSERT INTO film VALUES (1002, 'Film B');")
cursor.execute("INSERT INTO film VALUES (1003, 'Film C');")


# Insert sample data into inventory (linking films to inventory items)
cursor.execute("INSERT INTO inventory VALUES (10001, 1001, 1);") # Film A in inventory
cursor.execute("INSERT INTO inventory VALUES (10002, 1002, 1);") # Film B in inventory
cursor.execute("INSERT INTO inventory VALUES (10003, 1001, 2);") # Film A in another inventory
cursor.execute("INSERT INTO inventory VALUES (10004, 1003, 1);") # Film C in inventory


# Insert sample data into rental (linking rentals to inventory and customers)
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27', 10001, 1, 1);") # Mary (London) rented Film A
cursor.execute("INSERT INTO rental VALUES (2, '2023-10-28', 10002, 2, 1);") # Patricia (London) rented Film B
cursor.execute("INSERT INTO rental VALUES (3, '2023-10-28', 10001, 1, 2);") # Mary (London) rented Film A again
cursor.execute("INSERT INTO rental VALUES (4, '2023-10-29', 10004, 1, 1);") # Mary (London) rented Film C


# Execute the SQL query to list movies rented by customers in 'London'
cursor.execute("""
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    GROUP_CONCAT(f.title, ', ') AS rented_movies
FROM
    customer c
JOIN
    address a ON c.address_id = a.address_id
JOIN
    city ci ON a.city_id = ci.city_id
JOIN
    rental r ON c.customer_id = r.customer_id
JOIN
    inventory i ON r.inventory_id = i.inventory_id
JOIN
    film f ON i.film_id = f.film_id
WHERE
    ci.city = 'London'
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    c.last_name, c.first_name;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Movies rented by customers in London:")
    for row in results:
        print(row)
else:
    print("No rentals found for customers in London.")

# Close the connection
conn.close()

Movies rented by customers in London:
(2, 'Patricia', 'Johnson', 'Film B')
(1, 'Mary', 'Smith', 'Film A, Film A, Film C')

##Advanced Joins and GROUP BY:

**Question 13:**

Display the top 5 rented movies along with the number of times they've been rented.

Hint: JOIN film, inventory, and rental tables, then use COUNT () and GROUP BY, and limit the results

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL
    -- Add other film columns if needed
);
""")

cursor.execute("""
CREATE TABLE inventory (
    inventory_id INTEGER PRIMARY KEY,
    film_id INTEGER,
    store_id INTEGER,
    FOREIGN KEY (film_id) REFERENCES film(film_id)
    -- Add other inventory columns
);
""")

cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date DATE,
    inventory_id INTEGER,
    customer_id INTEGER,
    staff_id INTEGER,
    FOREIGN KEY (inventory_id) REFERENCES inventory(inventory_id)
    -- Add other rental columns
);
""")

# Insert sample data into film
cursor.execute("INSERT INTO film VALUES (101, 'Film A');")
cursor.execute("INSERT INTO film VALUES (102, 'Film B');")
cursor.execute("INSERT INTO film VALUES (103, 'Film C');")
cursor.execute("INSERT INTO film VALUES (104, 'Film D');")
cursor.execute("INSERT INTO film VALUES (105, 'Film E');")


# Insert sample data into inventory
cursor.execute("INSERT INTO inventory VALUES (1001, 101, 1);") # Film A
cursor.execute("INSERT INTO inventory VALUES (1002, 102, 1);") # Film B
cursor.execute("INSERT INTO inventory VALUES (1003, 101, 2);") # Film A (another copy)
cursor.execute("INSERT INTO inventory VALUES (1004, 103, 1);") # Film C
cursor.execute("INSERT INTO inventory VALUES (1005, 101, 1);") # Film A (another copy)
cursor.execute("INSERT INTO inventory VALUES (1006, 102, 2);") # Film B (another copy)
cursor.execute("INSERT INTO inventory VALUES (1007, 104, 1);") # Film D


# Insert sample data into rental
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27', 1001, 1, 1);") # Film A rented
cursor.execute("INSERT INTO rental VALUES (2, '2023-10-28', 1002, 2, 1);") # Film B rented
cursor.execute("INSERT INTO rental VALUES (3, '2023-10-28', 1003, 3, 2);") # Film A rented
cursor.execute("INSERT INTO rental VALUES (4, '2023-10-29', 1004, 1, 1);") # Film C rented
cursor.execute("INSERT INTO rental VALUES (5, '2023-10-29', 1001, 2, 1);") # Film A rented
cursor.execute("INSERT INTO rental VALUES (6, '2023-10-30', 1002, 3, 2);") # Film B rented
cursor.execute("INSERT INTO rental VALUES (7, '2023-10-30', 1005, 1, 1);") # Film A rented
cursor.execute("INSERT INTO rental VALUES (8, '2023-10-31', 1006, 2, 1);") # Film B rented
cursor.execute("INSERT INTO rental VALUES (9, '2023-10-31', 1004, 3, 2);") # Film C rented


# Execute the SQL query to display the top 5 rented movies
cursor.execute("""
SELECT
    f.title,
    COUNT(r.rental_id) AS rental_count
FROM
    film f
JOIN
    inventory i ON f.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    f.title
ORDER BY
    rental_count DESC
LIMIT 5;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Top 5 rented movies:")
    for row in results:
        print(row)
else:
    print("No rental data found.")

# Close the connection
conn.close()

Top 5 rented movies:
('Film A', 4)
('Film B', 3)
('Film C', 2)

**Question 14:**

Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).

Hint: Use JOINS with rental, inventory, and customer tables and consider COUNT() and GROUP BY

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
    -- Add other customer columns if needed
);
""")

cursor.execute("""
CREATE TABLE inventory (
    inventory_id INTEGER PRIMARY KEY,
    film_id INTEGER,
    store_id INTEGER
    -- Add other inventory columns if needed
);
""")

cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date DATE,
    inventory_id INTEGER,
    customer_id INTEGER,
    staff_id INTEGER,
    FOREIGN KEY (inventory_id) REFERENCES inventory(inventory_id),
    FOREIGN KEY (customer_id) REFERENCES customer(customer_id)
    -- Add other rental columns if needed
);
""")

# Insert sample data into customer
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith');")
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson');")
cursor.execute("INSERT INTO customer VALUES (3, 'Linda', 'Williams');")


# Insert sample data into inventory (linking films to inventory items and stores)
cursor.execute("INSERT INTO inventory VALUES (1001, 101, 1);") # Film 101 in Store 1
cursor.execute("INSERT INTO inventory VALUES (1002, 102, 2);") # Film 102 in Store 2
cursor.execute("INSERT INTO inventory VALUES (1003, 101, 1);") # Film 101 in Store 1 (another copy)
cursor.execute("INSERT INTO inventory VALUES (1004, 103, 2);") # Film 103 in Store 2
cursor.execute("INSERT INTO inventory VALUES (1005, 101, 2);") # Film 101 in Store 2


# Insert sample data into rental (linking rentals to inventory and customers)
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27', 1001, 1, 1);") # Mary rented from Store 1
cursor.execute("INSERT INTO rental VALUES (2, '2023-10-28', 1002, 2, 1);") # Patricia rented from Store 2
cursor.execute("INSERT INTO rental VALUES (3, '2023-10-28', 1004, 1, 2);") # Mary rented from Store 2
cursor.execute("INSERT INTO rental VALUES (4, '2023-10-29', 1003, 3, 1);") # Linda rented from Store 1
cursor.execute("INSERT INTO rental VALUES (5, '2023-10-29', 1005, 2, 1);") # Patricia rented from Store 2


# Execute the SQL query to find customers who rented from both stores
cursor.execute("""
SELECT
    c.customer_id,
    c.first_name,
    c.last_name
FROM
    customer c
JOIN
    rental r ON c.customer_id = r.customer_id
JOIN
    inventory i ON r.inventory_id = i.inventory_id
WHERE
    i.store_id IN (1, 2)
GROUP BY
    c.customer_id, c.first_name, c.last_name
HAVING
    COUNT(DISTINCT i.store_id) = 2;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customers who rented from both stores:")
    for row in results:
        print(row)
else:
    print("No customers found who rented from both stores.")

# Close the connection
conn.close()

Customers who rented from both stores:
(1, 'Mary', 'Smith')

##Windows Function:

1. Rank the customers based on the total amount they've spent on rentals.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
    -- Add other customer columns if needed
);
""")

cursor.execute("""
CREATE TABLE payment (
    payment_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    amount DECIMAL(10, 2),
    FOREIGN KEY (customer_id) REFERENCES customer(customer_id)
);
""")

# Insert sample data into customer
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith');")
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson');")
cursor.execute("INSERT INTO customer VALUES (3, 'Linda', 'Williams');")
cursor.execute("INSERT INTO customer VALUES (4, 'Barbara', 'Jones');")


# Insert sample data into payment
cursor.execute("INSERT INTO payment VALUES (1, 1, 10.50);") # Mary
cursor.execute("INSERT INTO payment VALUES (2, 2, 20.00);") # Patricia
cursor.execute("INSERT INTO payment VALUES (3, 1, 5.75);")  # Mary
cursor.execute("INSERT INTO payment VALUES (4, 3, 15.00);") # Linda
cursor.execute("INSERT INTO payment VALUES (5, 2, 8.20);")  # Patricia
cursor.execute("INSERT INTO payment VALUES (6, 4, 12.00);") # Barbara
cursor.execute("INSERT INTO payment VALUES (7, 1, 2.00);")  # Mary


# Rank customers by total amount spent on rentals
cursor.execute("""
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_spent,
    RANK() OVER (ORDER BY SUM(p.amount) DESC) AS spending_rank
FROM
    customer c
JOIN
    payment p ON c.customer_id = p.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    spending_rank;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customer spending rank:")
    for row in results:
        print(row)
else:
    print("No customer payment data found.")

# Close the connection
conn.close()

Customer spending rank:
(2, 'Patricia', 'Johnson', 28.2, 1)
(1, 'Mary', 'Smith', 18.25, 2)
(3, 'Linda', 'Williams', 15, 3)
(4, 'Barbara', 'Jones', 12, 4)

2. Calculate the cumulative revenue generated by each film over time.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL
    -- Add other film columns if needed
);
""")

cursor.execute("""
CREATE TABLE inventory (
    inventory_id INTEGER PRIMARY KEY,
    film_id INTEGER,
    FOREIGN KEY (film_id) REFERENCES film(film_id)
    -- Add other inventory columns if needed
);
""")

cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date DATE, -- Or TEXT for date strings
    inventory_id INTEGER,
    FOREIGN KEY (inventory_id) REFERENCES inventory(inventory_id)
    -- Add other rental columns if needed
);
""")

cursor.execute("""
CREATE TABLE payment (
    payment_id INTEGER PRIMARY KEY,
    rental_id INTEGER,
    amount DECIMAL(10, 2),
    FOREIGN KEY (rental_id) REFERENCES rental(rental_id)
    -- Add other payment columns if needed
);
""")

# Insert sample data into film
cursor.execute("INSERT INTO film VALUES (101, 'Film A');")
cursor.execute("INSERT INTO film VALUES (102, 'Film B');")


# Insert sample data into inventory
cursor.execute("INSERT INTO inventory VALUES (1001, 101);") # Film A
cursor.execute("INSERT INTO inventory VALUES (1002, 102);") # Film B
cursor.execute("INSERT INTO inventory VALUES (1003, 101);") # Film A (another copy)


# Insert sample data into rental (linking to inventory and providing dates)
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27', 1001);") # Film A rented
cursor.execute("INSERT INTO rental VALUES (2, '2023-10-28', 1002);") # Film B rented
cursor.execute("INSERT INTO rental VALUES (3, '2023-10-28', 1003);") # Film A rented


# Insert sample data into payment (linking to rentals and providing amounts)
cursor.execute("INSERT INTO payment VALUES (1, 1, 5.00);") # Payment for rental 1 (Film A)
cursor.execute("INSERT INTO payment VALUES (2, 2, 3.00);") # Payment for rental 2 (Film B)
cursor.execute("INSERT INTO payment VALUES (3, 3, 4.50);") # Payment for rental 3 (Film A)
cursor.execute("INSERT INTO payment VALUES (4, 1, 2.00);") # Another payment for rental 1 (Film A)


# Cumulative revenue generated by each film over time
cursor.execute("""
SELECT
    f.title AS film_title,
    r.rental_date,
    SUM(p.amount) OVER (
        PARTITION BY f.film_id
        ORDER BY r.rental_date
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ) AS cumulative_revenue
FROM
    payment p
JOIN
    rental r ON p.rental_id = r.rental_id
JOIN
    inventory i ON r.inventory_id = i.inventory_id
JOIN
    film f ON i.film_id = f.film_id
ORDER BY
    f.title, r.rental_date;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Cumulative revenue per film over time:")
    for row in results:
        print(row)
else:
    print("No data found for cumulative revenue calculation.")

# Close the connection
conn.close()

Cumulative revenue per film over time:
('Film A', '2023-10-27', 5)
('Film A', '2023-10-27', 7)
('Film A', '2023-10-28', 11.5)
('Film B', '2023-10-28', 3)

3. Determine the average rental duration for each film, considering films with similar lengths.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    length INTEGER -- Film length in minutes
);
""")

cursor.execute("""
CREATE TABLE inventory (
    inventory_id INTEGER PRIMARY KEY,
    film_id INTEGER,
    store_id INTEGER,
    FOREIGN KEY (film_id) REFERENCES film(film_id)
);
""")

cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date TEXT NOT NULL, -- Use TEXT for date strings in SQLite
    return_date TEXT, -- Use TEXT for date strings in SQLite
    inventory_id INTEGER,
    customer_id INTEGER,
    staff_id INTEGER,
    FOREIGN KEY (inventory_id) REFERENCES inventory(inventory_id)
);
""")

# Insert sample data into film
cursor.execute("INSERT INTO film VALUES (101, 'Film A', 90);") # Length 90
cursor.execute("INSERT INTO film VALUES (102, 'Film B', 90);") # Length 90
cursor.execute("INSERT INTO film VALUES (103, 'Film C', 120);") # Length 120


# Insert sample data into inventory
cursor.execute("INSERT INTO inventory VALUES (1001, 101, 1);") # Film A
cursor.execute("INSERT INTO inventory VALUES (1002, 102, 1);") # Film B
cursor.execute("INSERT INTO inventory VALUES (1003, 101, 2);") # Film A


# Insert sample data into rental
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27', '2023-11-01', 1001, 1, 1);") # Film A, duration 5 days
cursor.execute("INSERT INTO rental VALUES (2, '2023-10-28', '2023-11-05', 1002, 2, 1);") # Film B, duration 8 days
cursor.execute("INSERT INTO rental VALUES (3, '2023-10-28', '2023-11-04', 1001, 3, 2);") # Film A, duration 7 days
cursor.execute("INSERT INTO rental VALUES (4, '2023-10-29', NULL, 1003, 1, 1);") # Film A, not returned


# Average rental duration for each film, considering films with similar lengths
cursor.execute("""
SELECT
    f.title,
    f.length AS film_length_minutes,
    AVG(JULIANDAY(r.return_date) - JULIANDAY(r.rental_date)) AS avg_rental_duration_days
FROM
    film f
JOIN
    inventory i ON f.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
WHERE
    r.return_date IS NOT NULL  -- Ensure rentals were actually returned
GROUP BY
    f.title, f.length
ORDER BY
    f.length, avg_rental_duration_days DESC;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Average rental duration per film (grouped by length):")
    for row in results:
        print(row)
else:
    print("No rental data found for completed rentals.")

# Close the connection
conn.close()

Average rental duration per film (grouped by length):
('Film B', 90, 8.0)
('Film A', 90, 6.0)

4. Identify the top 3 films in each category based on their rental counts

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE category (
    category_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL
);
""")

cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL
    -- Add other film columns if needed for realism
);
""")

cursor.execute("""
CREATE TABLE film_category (
    film_id INTEGER,
    category_id INTEGER,
    PRIMARY KEY (film_id, category_id),
    FOREIGN KEY (film_id) REFERENCES film(film_id),
    FOREIGN KEY (category_id) REFERENCES category(category_id)
);
""")

cursor.execute("""
CREATE TABLE inventory (
    inventory_id INTEGER PRIMARY KEY,
    film_id INTEGER,
    store_id INTEGER,
    FOREIGN KEY (film_id) REFERENCES film(film_id)
    -- Add other inventory columns
);
""")

cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date DATE,
    inventory_id INTEGER,
    customer_id INTEGER,
    staff_id INTEGER,
    FOREIGN KEY (inventory_id) REFERENCES inventory(inventory_id)
    -- Add other rental columns
);
""")

# Insert sample data into category
cursor.execute("INSERT INTO category VALUES (1, 'Action');")
cursor.execute("INSERT INTO category VALUES (2, 'Comedy');")
cursor.execute("INSERT INTO category VALUES (3, 'Drama');")


# Insert sample data into film
cursor.execute("INSERT INTO film VALUES (101, 'Film A');") # Action, Comedy
cursor.execute("INSERT INTO film VALUES (102, 'Film B');") # Comedy, Drama
cursor.execute("INSERT INTO film VALUES (103, 'Film C');") # Action


# Insert sample data into film_category
cursor.execute("INSERT INTO film_category VALUES (101, 1);") # Film A is Action
cursor.execute("INSERT INTO film_category VALUES (101, 2);") # Film A is Comedy
cursor.execute("INSERT INTO film_category VALUES (102, 2);") # Film B is Comedy
cursor.execute("INSERT INTO film_category VALUES (102, 3);") # Film B is Drama
cursor.execute("INSERT INTO film_category VALUES (103, 1);") # Film C is Action


# Insert sample data into inventory
cursor.execute("INSERT INTO inventory VALUES (1001, 101, 1);") # Film A in inventory
cursor.execute("INSERT INTO inventory VALUES (1002, 102, 1);") # Film B in inventory
cursor.execute("INSERT INTO inventory VALUES (1003, 101, 2);") # Film A in another inventory
cursor.execute("INSERT INTO inventory VALUES (1004, 103, 1);") # Film C in inventory


# Insert sample data into rental
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27', 1001, 1, 1);") # Rental for Film A (Action, Comedy)
cursor.execute("INSERT INTO rental VALUES (2, '2023-10-28', 1002, 2, 1);") # Rental for Film B (Comedy, Drama)
cursor.execute("INSERT INTO rental VALUES (3, '2023-10-28', 1001, 3, 2);") # Another rental for Film A (Action, Comedy)
cursor.execute("INSERT INTO rental VALUES (4, '2023-10-29', 1004, 1, 1);") # Rental for Film C (Action)


# Identify the top 3 films in each category based on their rental counts
cursor.execute("""
WITH RankedFilms AS (
    SELECT
        c.name AS category_name,
        f.title AS film_title,
        COUNT(r.rental_id) AS rental_count,
        RANK() OVER (
            PARTITION BY c.name
            ORDER BY COUNT(r.rental_id) DESC
        ) AS rank_within_category
    FROM
        category c
    JOIN
        film_category fc ON c.category_id = fc.category_id
    JOIN
        film f ON fc.film_id = f.film_id
    JOIN
        inventory i ON f.film_id = i.film_id
    JOIN
        rental r ON i.inventory_id = r.inventory_id
    GROUP BY
        c.name, f.title
)
SELECT
    category_name,
    film_title,
    rental_count,
    rank_within_category
FROM
    RankedFilms
WHERE
    rank_within_category <= 3
ORDER BY
    category_name, rank_within_category;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Top 3 films in each category by rental count:")
    for row in results:
        print(row)
else:
    print("No rental data found for categories.")

# Close the connection
conn.close()

Top 3 films in each category by rental count:
('Action', 'Film A', 2, 1)
('Action', 'Film C', 1, 2)
('Comedy', 'Film A', 2, 1)
('Comedy', 'Film B', 1, 2)
('Drama', 'Film B', 1, 1)

5. Calculate the difference in rental counts between each customer's total rentals and the average rentals across all customers.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
    -- Add other customer columns if needed
);
""")

cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    FOREIGN KEY (customer_id) REFERENCES customer(customer_id)
    -- Add other rental columns if needed
);
""")

# Insert sample data into customer
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith');")
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson');")
cursor.execute("INSERT INTO customer VALUES (3, 'Linda', 'Williams');")
cursor.execute("INSERT INTO customer VALUES (4, 'Barbara', 'Jones');")


# Insert sample data into rental (with varying rental counts per customer)
cursor.execute("INSERT INTO rental VALUES (1, 1);") # Mary
cursor.execute("INSERT INTO rental VALUES (2, 2);") # Patricia
cursor.execute("INSERT INTO rental VALUES (3, 1);") # Mary
cursor.execute("INSERT INTO rental VALUES (4, 3);") # Linda
cursor.execute("INSERT INTO rental VALUES (5, 2);") # Patricia
cursor.execute("INSERT INTO rental VALUES (6, 1);") # Mary
cursor.execute("INSERT INTO rental VALUES (7, 4);") # Barbara


# Calculate rental count difference from average
cursor.execute("""
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    COUNT(r.rental_id) AS total_rentals,
    ROUND(AVG(COUNT(r.rental_id)) OVER (), 2) AS avg_rentals_across_customers,
    COUNT(r.rental_id) - AVG(COUNT(r.rental_id)) OVER () AS rental_diff
FROM
    customer c
JOIN
    rental r ON c.customer_id = r.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    rental_diff DESC;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Rental count difference from average per customer:")
    for row in results:
        print(row)
else:
    print("No rental data found.")

# Close the connection
conn.close()

Rental count difference from average per customer:
(1, 'Mary', 'Smith', 3, 1.75, 1.25)
(2, 'Patricia', 'Johnson', 2, 1.75, 0.25)
(3, 'Linda', 'Williams', 1, 1.75, -0.75)
(4, 'Barbara', 'Jones', 1, 1.75, -0.75)

6. Find the monthly revenue trend for the entire rental store over time.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy payment table with sample data
cursor.execute("""
CREATE TABLE payment (
    payment_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    staff_id INTEGER,
    rental_id INTEGER,
    amount DECIMAL(10, 2),
    payment_date TEXT -- Use TEXT for date strings in SQLite
);
""")

# Insert some sample data with payment dates and amounts
cursor.execute("INSERT INTO payment VALUES (1, 1, 1, 1, 10.50, '2023-10-27');")
cursor.execute("INSERT INTO payment VALUES (2, 2, 1, 2, 20.00, '2023-10-28');")
cursor.execute("INSERT INTO payment VALUES (3, 1, 2, 3, 5.75, '2023-11-01');")
cursor.execute("INSERT INTO payment VALUES (4, 3, 1, 4, 15.00, '2023-11-05');")
cursor.execute("INSERT INTO payment VALUES (5, 2, 1, 5, 8.20, '2023-12-10');")
cursor.execute("INSERT INTO payment VALUES (6, 1, 2, 6, 12.00, '2023-12-15');")


# Monthly revenue trend over time
cursor.execute("""
SELECT
    strftime('%Y-%m', payment_date) AS month,
    SUM(amount) AS monthly_revenue
FROM
    payment
GROUP BY
    strftime('%Y-%m', payment_date)
ORDER BY
    month;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Monthly revenue trend:")
    for row in results:
        print(row)
else:
    print("No payment data found.")

# Close the connection
conn.close()

Monthly revenue trend:
('2023-10', 30.5)
('2023-11', 20.75)
('2023-12', 20.2)

7. Identify the customers whose total spending on rentals falls within the top 20% of all customers.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
    -- Add other customer columns if needed
);
""")

cursor.execute("""
CREATE TABLE payment (
    payment_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    amount DECIMAL(10, 2),
    FOREIGN KEY (customer_id) REFERENCES customer(customer_id)
);
""")

# Insert sample data into customer
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith');")
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson');")
cursor.execute("INSERT INTO customer VALUES (3, 'Linda', 'Williams');")
cursor.execute("INSERT INTO customer VALUES (4, 'Barbara', 'Jones');")
cursor.execute("INSERT INTO customer VALUES (5, 'Elizabeth', 'Brown');")


# Insert sample data into payment (varying amounts to create different percentiles)
cursor.execute("INSERT INTO payment VALUES (1, 1, 10.50);") # Mary
cursor.execute("INSERT INTO payment VALUES (2, 2, 50.00);") # Patricia (High spender)
cursor.execute("INSERT INTO payment VALUES (3, 1, 5.75);")  # Mary
cursor.execute("INSERT INTO payment VALUES (4, 3, 15.00);") # Linda
cursor.execute("INSERT INTO payment VALUES (5, 2, 25.00);") # Patricia
cursor.execute("INSERT INTO payment VALUES (6, 4, 12.00);") # Barbara
cursor.execute("INSERT INTO payment VALUES (7, 5, 8.00);")  # Elizabeth
cursor.execute("INSERT INTO payment VALUES (8, 2, 10.00);") # Patricia


# Find customers in the top 20% of total rental spending
cursor.execute("""
WITH customer_spending AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(p.amount) AS total_spent,
        PERCENT_RANK() OVER (ORDER BY SUM(p.amount) DESC) AS spending_percentile
    FROM
        customer c
    JOIN
        payment p ON c.customer_id = p.customer_id
    GROUP BY
        c.customer_id, c.first_name, c.last_name
)

SELECT
    customer_id,
    first_name,
    last_name,
    total_spent,
    spending_percentile
FROM
    customer_spending
WHERE
    spending_percentile <= 0.20 -- Top 20% have a percentile rank of 0.20 or less
ORDER BY
    spending_percentile;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customers in the top 20% of total spending:")
    for row in results:
        print(row)
else:
    print("No customers found in the top 20% (or no payment data).")

# Close the connection
conn.close()

Customers in the top 20% of total spending:
(2, 'Patricia', 'Johnson', 85, 0.0)

8. Calculate the running total of rentals per category, ordered by rental count.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE category (
    category_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL
);
""")

cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL
    -- Add other film columns if needed for realism
);
""")

cursor.execute("""
CREATE TABLE film_category (
    film_id INTEGER,
    category_id INTEGER,
    PRIMARY KEY (film_id, category_id),
    FOREIGN KEY (film_id) REFERENCES film(film_id),
    FOREIGN KEY (category_id) REFERENCES category(category_id)
);
""")

cursor.execute("""
CREATE TABLE inventory (
    inventory_id INTEGER PRIMARY KEY,
    film_id INTEGER,
    store_id INTEGER,
    FOREIGN KEY (film_id) REFERENCES film(film_id)
    -- Add other inventory columns
);
""")

cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date DATE,
    inventory_id INTEGER,
    customer_id INTEGER,
    staff_id INTEGER,
    FOREIGN KEY (inventory_id) REFERENCES inventory(inventory_id)
    -- Add other rental columns
);
""")

# Insert sample data into category
cursor.execute("INSERT INTO category VALUES (1, 'Action');")
cursor.execute("INSERT INTO category VALUES (2, 'Comedy');")
cursor.execute("INSERT INTO category VALUES (3, 'Drama');")


# Insert sample data into film
cursor.execute("INSERT INTO film VALUES (101, 'Film A');") # Action, Comedy
cursor.execute("INSERT INTO film VALUES (102, 'Film B');") # Comedy, Drama
cursor.execute("INSERT INTO film VALUES (103, 'Film C');") # Action


# Insert sample data into film_category
cursor.execute("INSERT INTO film_category VALUES (101, 1);") # Film A is Action
cursor.execute("INSERT INTO film_category VALUES (101, 2);") # Film A is Comedy
cursor.execute("INSERT INTO film_category VALUES (102, 2);") # Film B is Comedy
cursor.execute("INSERT INTO film_category VALUES (102, 3);") # Film B is Drama
cursor.execute("INSERT INTO film_category VALUES (103, 1);") # Film C is Action


# Insert sample data into inventory
cursor.execute("INSERT INTO inventory VALUES (1001, 101, 1);") # Film A in inventory
cursor.execute("INSERT INTO inventory VALUES (1002, 102, 1);") # Film B in inventory
cursor.execute("INSERT INTO inventory VALUES (1003, 101, 2);") # Film A in another inventory


# Insert sample data into rental
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27', 1001, 1, 1);") # Rental for Film A (Action, Comedy)
cursor.execute("INSERT INTO rental VALUES (2, '2023-10-28', 1002, 2, 1);") # Rental for Film B (Comedy, Drama)
cursor.execute("INSERT INTO rental VALUES (3, '2023-10-28', 1001, 3, 2);") # Another rental for Film A (Action, Comedy)


# Calculate the running total of rentals per category, ordered by rental count.
cursor.execute("""
WITH category_rental_counts AS (
    SELECT
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM
        category c
    JOIN
        film_category fc ON c.category_id = fc.category_id
    JOIN
        film f ON fc.film_id = f.film_id
    JOIN
        inventory i ON f.film_id = i.film_id
    JOIN
        rental r ON i.inventory_id = r.inventory_id
    GROUP BY
        c.name
)
SELECT
    category_name,
    rental_count,
    SUM(rental_count) OVER (ORDER BY rental_count DESC) AS running_total
FROM
    category_rental_counts
ORDER BY
    rental_count DESC;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Running total of rentals per category:")
    for row in results:
        print(row)
else:
    print("No rental data found for categories.")

# Close the connection
conn.close()

Running total of rentals per category:
('Comedy', 3, 3)
('Action', 2, 5)
('Drama', 1, 6)

9. Find the films that have been rented less than the average rental count for their respective categories.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE category (
    category_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL
);
""")

cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL
);
""")

cursor.execute("""
CREATE TABLE film_category (
    film_id INTEGER,
    category_id INTEGER,
    PRIMARY KEY (film_id, category_id),
    FOREIGN KEY (film_id) REFERENCES film(film_id),
    FOREIGN KEY (category_id) REFERENCES category(category_id)
);
""")

cursor.execute("""
CREATE TABLE inventory (
    inventory_id INTEGER PRIMARY KEY,
    film_id INTEGER,
    store_id INTEGER,
    FOREIGN KEY (film_id) REFERENCES film(film_id)
);
""")

cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    inventory_id INTEGER,
    FOREIGN KEY (inventory_id) REFERENCES inventory(inventory_id)
);
""")

# Insert sample data into category
cursor.execute("INSERT INTO category VALUES (1, 'Action');")
cursor.execute("INSERT INTO category VALUES (2, 'Comedy');")


# Insert sample data into film
cursor.execute("INSERT INTO film VALUES (101, 'Film A');") # Action, Comedy
cursor.execute("INSERT INTO film VALUES (102, 'Film B');") # Comedy
cursor.execute("INSERT INTO film VALUES (103, 'Film C');") # Action


# Insert sample data into film_category
cursor.execute("INSERT INTO film_category VALUES (101, 1);") # Film A is Action
cursor.execute("INSERT INTO film_category VALUES (101, 2);") # Film A is Comedy
cursor.execute("INSERT INTO film_category VALUES (102, 2);") # Film B is Comedy
cursor.execute("INSERT INTO film_category VALUES (103, 1);") # Film C is Action


# Insert sample data into inventory
cursor.execute("INSERT INTO inventory VALUES (1001, 101, 1);") # Film A
cursor.execute("INSERT INTO inventory VALUES (1002, 102, 1);") # Film B
cursor.execute("INSERT INTO inventory VALUES (1003, 101, 2);") # Film A
cursor.execute("INSERT INTO inventory VALUES (1004, 103, 1);") # Film C


# Insert sample data into rental
cursor.execute("INSERT INTO rental VALUES (1, 1001);") # Film A rented
cursor.execute("INSERT INTO rental VALUES (2, 1002);") # Film B rented
cursor.execute("INSERT INTO rental VALUES (3, 1001);") # Film A rented
cursor.execute("INSERT INTO rental VALUES (4, 1004);") # Film C rented
cursor.execute("INSERT INTO rental VALUES (5, 1001);") # Film A rented
cursor.execute("INSERT INTO rental VALUES (6, 1002);") # Film B rented


# Execute the SQL query with CTEs
cursor.executescript("""
-- Step 1: Compute rental counts for each film with its category
WITH film_rentals AS (
    SELECT
        f.film_id,
        f.title,
        c.name AS category_name,
        COUNT(r.rental_id) AS film_rental_count
    FROM
        film f
    JOIN
        film_category fc ON f.film_id = fc.film_id
    JOIN
        category c ON fc.category_id = c.category_id
    JOIN
        inventory i ON f.film_id = i.film_id
    JOIN
        rental r ON i.inventory_id = r.inventory_id
    GROUP BY
        f.film_id, f.title, c.name
),

-- Step 2: Compute average rental count per category
category_avg AS (
    SELECT
        category_name,
        AVG(film_rental_count) AS avg_rental_count
    FROM
        film_rentals
    GROUP BY
        category_name
)

-- Step 3: Compare each film's rental count to its category's average
SELECT
    fr.title,
    fr.category_name,
    fr.film_rental_count,
    ca.avg_rental_count
FROM
    film_rentals fr
JOIN
    category_avg ca ON fr.category_name = ca.category_name
WHERE
    fr.film_rental_count < ca.avg_rental_count
ORDER BY
    fr.category_name, fr.film_rental_count;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Films rented less than the average for their category:")
    for row in results:
        print(row)
else:
    print("No films found that were rented less than their category's average.")

# Close the connection
conn.close()

No films found that were rented less than their category's average.

10. Identify the top 5 months with the highest revenue and display the revenue generated in each month.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy payment table with sample data
cursor.execute("""
CREATE TABLE payment (
    payment_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    staff_id INTEGER,
    rental_id INTEGER,
    amount DECIMAL(10, 2),
    payment_date TEXT -- Use TEXT for date strings in SQLite
);
""")

# Insert some sample data with payment dates and amounts
cursor.execute("INSERT INTO payment VALUES (1, 1, 1, 1, 10.50, '2023-10-27');")
cursor.execute("INSERT INTO payment VALUES (2, 2, 1, 2, 20.00, '2023-10-28');")
cursor.execute("INSERT INTO payment VALUES (3, 1, 2, 3, 5.75, '2023-11-01');")
cursor.execute("INSERT INTO payment VALUES (4, 3, 1, 4, 15.00, '2023-11-05');")
cursor.execute("INSERT INTO payment VALUES (5, 2, 1, 5, 8.20, '2023-12-10');")
cursor.execute("INSERT INTO payment VALUES (6, 1, 2, 6, 12.00, '2023-12-15');")
cursor.execute("INSERT INTO payment VALUES (7, 4, 1, 7, 30.00, '2023-10-29');") # Additional data for October
cursor.execute("INSERT INTO payment VALUES (8, 5, 2, 8, 25.00, '2023-11-10');") # Additional data for November
cursor.execute("INSERT INTO payment VALUES (9, 6, 1, 9, 18.00, '2023-12-20');") # Additional data for December


# Identify the top 5 months with the highest revenue
cursor.execute("""
SELECT
    strftime('%Y-%m', payment_date) AS month,
    SUM(amount) AS total_revenue
FROM
    payment
GROUP BY
    strftime('%Y-%m', payment_date)
ORDER BY
    total_revenue DESC
LIMIT 5;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Top 5 months with the highest revenue:")
    for row in results:
        print(row)
else:
    print("No payment data found.")

# Close the connection
conn.close()

Top 5 months with the highest revenue:
('2023-10', 60.5)
('2023-11', 45.75)
('2023-12', 38.2)

##Normalisation & CTE

**Q1. First Normal Form (1NF):**

 a. Identify a table in the Sakila database that violates 1NF. Explain how you would normalize

**Answer**

**Step 1: Recall 1NF Rules**

A table violates 1NF if:

- It has repeating groups or arrays in a column.

- It has non-atomic values (multiple values stored in a single cell).

- It doesn’t have a primary key.

**Step 2: Identify a Sakila Table that Violates 1NF**

One common candidate in Sakila is the film table.

The film table has columns like:

- special_features → contains a comma-separated list (e.g., "Trailers,Deleted Scenes")

- Actors are connected via a junction table (film_actor), which is fine, but if we stored them inside film as a list it would break 1NF.

So, the film.special_features column violates 1NF because it stores multiple values in one cell instead of atomic data.

**Step 3: How to Normalize to 1NF**

*To fix this:*

- Create a new table film_special_feature that stores one row per film-feature pair.

In [5]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy film table with the special_features column
cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    special_features TEXT -- Column violating 1NF
);
""")

# Insert some sample data with non-atomic special_features
cursor.execute("INSERT INTO film VALUES (1, 'Film A', 'Trailers,Deleted Scenes');")
cursor.execute("INSERT INTO film VALUES (2, 'Film B', 'Commentaries,Behind the Scenes');")
cursor.execute("INSERT INTO film VALUES (3, 'Film C', 'Trailers');")


# Create the film_special_feature table to normalize 1NF
cursor.execute("""
CREATE TABLE film_special_feature (
    film_id INTEGER,
    feature VARCHAR(50),
    FOREIGN KEY (film_id) REFERENCES film(film_id)
);
""")

# You would typically parse the special_features column and insert into the new table.
# For demonstration, here's how the data would look after normalization:
# INSERT INTO film_special_feature VALUES (1, 'Trailers');
# INSERT INTO film_special_feature VALUES (1, 'Deleted Scenes');
# INSERT INTO film_special_feature VALUES (2, 'Commentaries');
# INSERT INTO film_special_feature VALUES (2, 'Behind the Scenes');
# INSERT INTO film_special_feature VALUES (3, 'Trailers');

# After migrating the data, you would drop the original column (optional but good practice)
# ALTER TABLE film DROP COLUMN special_features; # SQLite does not support dropping columns directly with ALTER TABLE in older versions

print("Tables created and sample data inserted (demonstrating 1NF violation).")
print("film_special_feature table created (for normalization).")

# Close the connection
conn.close()

Tables created and sample data inserted (demonstrating 1NF violation).
film_special_feature table created (for normalization).

**Q2. Second Normal Form (2NF):**

 a. Choose a table in Sakila and describe how you would determine whether it is in 2NF.

 If it violates 2NF, explain the steps to normalize it.

**Step 1: Recall 2NF Rules**

A table is in 2NF if:

- It is already in 1NF.

- Every non-key attribute depends on the whole primary key, not just part of it.
This only matters for tables with composite primary keys.

If a non-key column depends only on part of the composite key, that’s a partial dependency → violation of 2NF.

**Step 2: Find a Candidate Table in Sakila**

One good example is film_actor:

- Primary Key = (actor_id, film_id) (composite key).

- Non-key attribute = last_update.

In [7]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy actor and film tables (needed for foreign keys)
cursor.execute("""
CREATE TABLE actor (
    actor_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
);
""")

cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL
);
""")


# Create the film_actor table (violating 2NF with last_update depending only on actor_id)
cursor.execute("""
CREATE TABLE film_actor (
    actor_id INTEGER NOT NULL,
    film_id INTEGER NOT NULL,
    last_update TIMESTAMP NOT NULL, -- This column depends only on actor_id, violating 2NF
    PRIMARY KEY (actor_id, film_id),
    FOREIGN KEY (actor_id) REFERENCES actor(actor_id),
    FOREIGN KEY (film_id) REFERENCES film(film_id)
);
""")

# Insert some sample data (demonstrating the partial dependency)
cursor.execute("INSERT INTO actor VALUES (1, 'Penelope', 'Guiness');")
cursor.execute("INSERT INTO actor VALUES (2, 'Nick', 'Wahlberg');")
cursor.execute("INSERT INTO film VALUES (101, 'Film A');")
cursor.execute("INSERT INTO film VALUES (102, 'Film B');")

# last_update here is associated with the actor, not the film_actor combination
cursor.execute("INSERT INTO film_actor VALUES (1, 101, '2023-10-27 10:00:00');")
cursor.execute("INSERT INTO film_actor VALUES (1, 102, '2023-10-27 10:00:00');") # Same actor_id, same last_update
cursor.execute("INSERT INTO film_actor VALUES (2, 101, '2023-10-28 11:00:00');")


print("Tables created and sample data inserted (demonstrating 2NF violation).")

# To normalize to 2NF, you would move `last_update` to the `actor` table.
# (Demonstration of the normalized structure):
# ALTER TABLE actor ADD COLUMN last_update TIMESTAMP;
# Then you would update the actor table with the correct last_update values
# and drop the column from film_actor.

# Close the connection
conn.close()

Tables created and sample data inserted (demonstrating 2NF violation).

**Step 3: Check for 2NF Violation**

last_update depends on the whole pair (actor_id, film_id), not just actor_id or film_id individually.

So this table is in 2NF.

But let’s imagine a violation scenario:

Suppose we wrongly added actor_name or film_title inside film_actor.

- actor_name depends only on actor_id.

- film_title depends only on film_id.
That would be a partial dependency, violating 2NF.

**Step 4: How to Normalize (if violated)**

If film_actor had actor_name and film_title inside it, the fix would be:

1. Remove actor_name → keep it in the actor table.

2. Remove film_title → keep it in the film table.

3. film_actor should only contain the linking IDs + attributes that depend on both (e.g., last_update).

Result:

- actor(actor_id, first_name, last_name, …)

- film(film_id, title, …)

- film_actor(actor_id, film_id, last_update)

**Q3. Third Normal Form (3NF):**

 a. Identify a table in Sakila that violates 3NF. Describe the transitive dependencies

 present and outline

**Step 1: Recall 3NF Rules**

- A table is in 3NF if:

- It is already in 2NF.

No transitive dependencies exist → i.e., non-key attributes must depend only on the primary key, not on another non-key attribute.

A transitive dependency looks like:

**Step 2: Find a Candidate Table in Sakila**

- A common example is the address table:

In [9]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy city table (needed for foreign key in address)
cursor.execute("""
CREATE TABLE city (
    city_id INTEGER PRIMARY KEY,
    city TEXT NOT NULL,
    country_id INTEGER -- Adding country_id for demonstration of 3NF violation
);
""")

# Create the address table (violating 3NF with city and country_id)
cursor.execute("""
CREATE TABLE address (
    address_id INTEGER PRIMARY KEY,
    address TEXT,
    address2 TEXT,
    district TEXT,
    city_id INTEGER,
    postal_code TEXT,
    phone TEXT,
    last_update TIMESTAMP,
    FOREIGN KEY (city_id) REFERENCES city(city_id)
);
""")

# Insert some sample data (demonstrating the transitive dependency)
cursor.execute("INSERT INTO city VALUES (1, 'London', 10);") # city_id 1, country_id 10
cursor.execute("INSERT INTO city VALUES (2, 'Paris', 20);") # city_id 2, country_id 20


cursor.execute("INSERT INTO address VALUES (101, '123 Main St', NULL, 'Westminster', 1, 'SW1A 0AA', '123-456-7890', '2023-10-27 10:00:00');") # Address in London
cursor.execute("INSERT INTO address VALUES (102, '456 Oak Ave', NULL, 'Latin Quarter', 2, '75005', '098-765-4321', '2023-10-28 11:00:00');") # Address in Paris


print("Tables created and sample data inserted (demonstrating potential 3NF violation).")
print("Note: The 'city' table in this example shows a transitive dependency if country_id were directly in the 'address' table.")

# To normalize to 3NF, you would move `country_id` and any other country-related
# attributes from the `city` table into a separate `country` table.
# (Demonstration of the normalized structure):
# CREATE TABLE country ( country_id INTEGER PRIMARY KEY, country TEXT NOT NULL);
# ALTER TABLE city ADD COLUMN country_id INTEGER; # Link city to country
# ALTER TABLE city ADD FOREIGN KEY (country_id) REFERENCES country(country_id);

# Close the connection
conn.close()

Tables created and sample data inserted (demonstrating potential 3NF violation).
Note: The 'city' table in this example shows a transitive dependency if country_id were directly in the 'address' table.

In [12]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the country table
cursor.execute("""
CREATE TABLE country (
    country_id INTEGER PRIMARY KEY,
    country TEXT NOT NULL
);
""")

# Create the city table with a foreign key referencing the country table
cursor.execute("""
CREATE TABLE city (
    city_id INTEGER PRIMARY KEY,
    city TEXT NOT NULL,
    country_id INTEGER,
    last_update TIMESTAMP,
    FOREIGN KEY (country_id) REFERENCES country(country_id)
);
""")

# Insert some sample data into country
cursor.execute("INSERT INTO country VALUES (10, 'United Kingdom');")
cursor.execute("INSERT INTO country VALUES (20, 'France');")


# Insert some sample data into city
cursor.execute("INSERT INTO city VALUES (1, 'London', 10, '2023-10-27 10:00:00');")
cursor.execute("INSERT INTO city VALUES (2, 'Paris', 20, '2023-10-28 11:00:00');")


print("Country and city tables created with foreign key relationship.")

# Close the connection
conn.close()

Country and city tables created with foreign key relationship.

**Step 3: Spot the 3NF Violation**

- In address, the primary key is address_id.

- Non-key attribute city_id determines another non-key attribute indirectly → the country (via the city table).

So the dependency looks like:

address_id → city_id → country_id


This is a transitive dependency, violating 3NF.

**Step 4: Normalize to 3NF**

To fix:

- Keep only city_id in address.

- Move country_id to the city table (which already exists in Sakila).

- If we wanted to be fully normalized, queries needing the country should JOIN address → city → country.

**Q4. Normalization Process:**

 a. Take a specific table in Sakila and guide through the process of normalizing it from the initial

 unnormalized form up to

**Step 1: Unnormalized Form (UNF)**

Imagine the film table was designed like this (unnormalized):

In [14]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the unnormalized film table
cursor.execute("""
CREATE TABLE film_unf (
    film_id INTEGER PRIMARY KEY, -- Added PRIMARY KEY for demonstration
    title VARCHAR(100),
    description TEXT,
    release_year INTEGER, -- Changed to INTEGER for compatibility
    language VARCHAR(20),
    rental_duration INTEGER, -- Changed to INTEGER for compatibility
    rental_rate DECIMAL(4,2),
    length INTEGER, -- Changed to INTEGER for compatibility
    replacement_cost DECIMAL(5,2),
    rating VARCHAR(5),
    special_features VARCHAR(200),  -- e.g. 'Trailers,Deleted Scenes'
    actors VARCHAR(500),            -- e.g. 'Tom Hanks,Julia Roberts'
    categories VARCHAR(200)         -- e.g. 'Drama,Romance'
);
""")

# Insert some sample data
cursor.execute("""
INSERT INTO film_unf VALUES (
    1,
    'Unnormalized Movie',
    'A movie demonstrating unnormalized data.',
    2023,
    'English',
    7,
    4.99,
    120,
    19.99,
    'PG-13',
    'Trailers,Behind the Scenes',
    'Actor One,Actor Two',
    'Action,Adventure'
);
""")

print("Unnormalized film table created with sample data.")

# Close the connection
conn.close()

Unnormalized film table created with sample data.

**Problems:**

- Repeating groups: actors, categories, special_features have multiple values inside one cell.

- Non-atomic values → violates 1NF.

**Step 2: First Normal Form (1NF)**

Rules: No repeating groups, every attribute atomic.

**Fix:** Split special_features, actors, categories into separate rows/tables.

In [16]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Base film table (already in 1NF if language_id is atomic)
cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title VARCHAR(100),
    description TEXT,
    release_year INTEGER,
    language_id INTEGER, -- Assumes language_id is atomic
    rental_duration INTEGER,
    rental_rate DECIMAL(4,2),
    length INTEGER,
    replacement_cost DECIMAL(5,2),
    rating VARCHAR(5)
);
""")

# Special features table (normalized 1NF)
cursor.execute("""
CREATE TABLE film_special_feature (
    film_id INTEGER,
    feature VARCHAR(50),
    FOREIGN KEY (film_id) REFERENCES film(film_id)
);
""")

# Actor relationship table (normalized 1NF)
cursor.execute("""
CREATE TABLE film_actor (
    film_id INTEGER,
    actor_id INTEGER,
    PRIMARY KEY (film_id, actor_id)
    -- FOREIGN KEY constraints would reference actual film and actor tables
    -- FOREIGN KEY (film_id) REFERENCES film(film_id),
    -- FOREIGN KEY (actor_id) REFERENCES actor(actor_id)
);
""")

# Category relationship table (normalized 1NF)
cursor.execute("""
CREATE TABLE film_category (
    film_id INTEGER,
    category_id INTEGER,
    PRIMARY KEY (film_id, category_id)
    -- FOREIGN KEY constraints would reference actual film and category tables
    -- FOREIGN KEY (film_id) REFERENCES film(film_id),
    -- FOREIGN KEY (category_id) REFERENCES category(category_id)
);
""")

# Insert sample data into the normalized tables (demonstration)
cursor.execute("INSERT INTO film VALUES (1, 'Normalized Movie', 'A movie normalized to 1NF.', 2023, 1, 7, 4.99, 120, 19.99, 'PG-13');")
cursor.execute("INSERT INTO film_special_feature VALUES (1, 'Trailers');")
cursor.execute("INSERT INTO film_special_feature VALUES (1, 'Behind the Scenes');")
cursor.execute("INSERT INTO film_actor VALUES (1, 10);") # Film 1, Actor 10
cursor.execute("INSERT INTO film_actor VALUES (1, 20);") # Film 1, Actor 20
cursor.execute("INSERT INTO film_category VALUES (1, 1);") # Film 1, Category 1
cursor.execute("INSERT INTO film_category VALUES (1, 2);") # Film 1, Category 2


print("Tables created and sample data inserted (demonstrating normalization to 1NF).")

# Close the connection
conn.close()

Tables created and sample data inserted (demonstrating normalization to 1NF).

**Step 3: Second Normal Form (2NF)**

Rules: No partial dependencies (applies when composite primary keys exist).

**Example:** In film_actor(film_id, actor_id), if we mistakenly added actor_name, that would depend only on actor_id, violating 2NF.

Fix: Keep actor_name in the actor table, not in film_actor.
Thus, Sakila’s film_actor is already in 2NF.

**Step 4: Third Normal Form (3NF)**

Rules: No transitive dependencies.

Example: Suppose film table stored language_name instead of language_id.
Then:

film_id → language_id → language_name
That’s a transitive dependency.

Fix: Store only language_id in film, and move language_name to the language table (which Sakila already has):

sql
Copy code
CREATE TABLE language (
    language_id INT PRIMARY KEY,
    name VARCHAR(50)
);

Now non-key attributes depend only on the primary key.

 **Step 5: Boyce-Codd Normal Form (BCNF) – optional**
BCNF is a stricter version of 3NF.
For Sakila’s film, there’s no violation since every determinant is a candidate key.

**Final Result (Fully Normalized Design)**
film(film_id, title, description, release_year, language_id, rental_duration, rental_rate, length, replacement_cost, rating)

film_special_feature(film_id, feature)

film_actor(film_id, actor_id)

film_category(film_id, category_id)

language(language_id, name)

actor(actor_id, first_name, last_name, …)

category(category_id, name)

**Q5. CTE Basics:**

Write a query using a CTE to retrieve the distinct list of actor names and the number of films they

have acted in from the actor and film_actor tables.

In [19]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE actor (
    actor_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
);
""")

cursor.execute("""
CREATE TABLE film_actor (
    actor_id INTEGER,
    film_id INTEGER,
    PRIMARY KEY (actor_id, film_id),
    FOREIGN KEY (actor_id) REFERENCES actor(actor_id)
    -- FOREIGN KEY (film_id) REFERENCES film(film_id) -- Film table not needed for this query
);
""")

# Insert sample data into actor
cursor.execute("INSERT INTO actor VALUES (1, 'Penelope', 'Guiness');")
cursor.execute("INSERT INTO actor VALUES (2, 'Nick', 'Wahlberg');")
cursor.execute("INSERT INTO actor VALUES (3, 'Ed', 'Chase');")


# Insert sample data into film_actor
cursor.execute("INSERT INTO film_actor VALUES (1, 101);") # Penelope in Film 101
cursor.execute("INSERT INTO film_actor VALUES (1, 102);") # Penelope in Film 102
cursor.execute("INSERT INTO film_actor VALUES (2, 101);") # Nick in Film 101
cursor.execute("INSERT INTO film_actor VALUES (3, 103);") # Ed in Film 103


# Write a query using a CTE to retrieve the distinct list of actor names and the number of films they have acted in
cursor.execute("""
WITH actor_film_count AS (
    SELECT
        a.actor_id,
        a.first_name || ' ' || a.last_name AS actor_name, -- Use || for string concatenation in SQLite
        COUNT(fa.film_id) AS film_count
    FROM actor a
    INNER JOIN film_actor fa
        ON a.actor_id = fa.actor_id
    GROUP BY a.actor_id, a.first_name, a.last_name
)
SELECT
    actor_name,
    film_count
FROM actor_film_count
ORDER BY film_count DESC;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Actor film counts:")
    for row in results:
        print(row)
else:
    print("No actor film data found.")

# Close the connection
conn.close()

Actor film counts:
('Penelope Guiness', 2)
('Nick Wahlberg', 1)
('Ed Chase', 1)

**Q6 CTE with Joins:**

 a. Create a CTE that combines information from the film and language tables to display the film title,

language name, and rental rate.

In [21]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE language (
    language_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL
);
""")

cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    language_id INTEGER,
    rental_rate DECIMAL(4, 2),
    FOREIGN KEY (language_id) REFERENCES language(language_id)
);
""")

# Insert sample data into language
cursor.execute("INSERT INTO language VALUES (1, 'English');")
cursor.execute("INSERT INTO language VALUES (2, 'Italian');")


# Insert sample data into film
cursor.execute("INSERT INTO film VALUES (101, 'Film A', 1, 2.99);") # English
cursor.execute("INSERT INTO film VALUES (102, 'Film B', 2, 0.99);") # Italian
cursor.execute("INSERT INTO film VALUES (103, 'Film C', 1, 4.99);") # English


# Create a CTE that combines information from the film and language tables
cursor.execute("""
WITH film_language_cte AS (
    SELECT
        f.film_id,
        f.title,
        l.name AS language_name,
        f.rental_rate
    FROM film f
    INNER JOIN language l
        ON f.language_id = l.language_id
)
SELECT
    title,
    language_name,
    rental_rate
FROM film_language_cte
ORDER BY title;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Film titles with language names and rental rates:")
    for row in results:
        print(row)
else:
    print("No film or language data found.")

# Close the connection
conn.close()

Film titles with language names and rental rates:
('Film A', 'English', 2.99)
('Film B', 'Italian', 0.99)
('Film C', 'English', 4.99)

**Q7. CTE for Aggregation:**

 a. Write a query using a CTE to find the total revenue generated by each customer (sum of payments)

 from the customer and payment tables.

In [23]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
    -- Add other customer columns if needed
);
""")

cursor.execute("""
CREATE TABLE payment (
    payment_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    amount DECIMAL(10, 2),
    FOREIGN KEY (customer_id) REFERENCES customer(customer_id)
);
""")

# Insert sample data into customer
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith');")
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson');")
cursor.execute("INSERT INTO customer VALUES (3, 'Linda', 'Williams');")


# Insert sample data into payment
cursor.execute("INSERT INTO payment VALUES (1, 1, 10.50);") # Payment by Mary
cursor.execute("INSERT INTO payment VALUES (2, 2, 20.00);") # Payment by Patricia
cursor.execute("INSERT INTO payment VALUES (3, 1, 5.75);")  # Another payment by Mary
cursor.execute("INSERT INTO payment VALUES (4, 3, 15.00);") # Payment by Linda
cursor.execute("INSERT INTO payment VALUES (5, 2, 8.20);")  # Another payment by Patricia


# Write a query using a CTE to find the total revenue generated by each customer
cursor.execute("""
WITH customer_revenue AS (
    SELECT
        c.customer_id,
        c.first_name || ' ' || c.last_name AS customer_name, -- Use || for string concatenation in SQLite
        SUM(p.amount) AS total_revenue
    FROM customer c
    INNER JOIN payment p
        ON c.customer_id = p.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
)
SELECT
    customer_name,
    total_revenue
FROM customer_revenue
ORDER BY total_revenue DESC;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customer total revenue:")
    for row in results:
        print(row)
else:
    print("No customer payment data found.")

# Close the connection
conn.close()

Customer total revenue:
('Patricia Johnson', 28.2)
('Mary Smith', 16.25)
('Linda Williams', 15)

**Q8. CTE with Window Functions:**

 a. Utilize a CTE with a window function to rank films based on their rental duration from the film table.

In [25]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy film table with rental_duration
cursor.execute("""
CREATE TABLE film (
    film_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    rental_duration INTEGER
);
""")

# Insert some sample data
cursor.execute("INSERT INTO film VALUES (1, 'Film A', 7);")
cursor.execute("INSERT INTO film VALUES (2, 'Film B', 5);")
cursor.execute("INSERT INTO film VALUES (3, 'Film C', 7);")
cursor.execute("INSERT INTO film VALUES (4, 'Film D', 3);")


# Utilize a CTE with a window function to rank films based on their rental duration
cursor.execute("""
WITH FilmRanked AS (
    SELECT
        film_id,
        title,
        rental_duration,
        RANK() OVER (ORDER BY rental_duration DESC) AS duration_rank
    FROM film
)
SELECT *
FROM FilmRanked
ORDER BY duration_rank, title;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Films ranked by rental duration:")
    for row in results:
        print(row)
else:
    print("No film data found.")

# Close the connection
conn.close()

Films ranked by rental duration:
(1, 'Film A', 7, 1)
(3, 'Film C', 7, 1)
(2, 'Film B', 5, 3)
(4, 'Film D', 3, 4)

**Q9. CTE and Filtering:**

 a. Create a CTE to list customers who have made more than two rentals, and then join this CTE with the customer table to retrieve additional customer details.

In [37]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE customer (
    customer_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    email VARCHAR(100),
    address_id INTEGER
);
""")

cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date DATE,
    inventory_id INTEGER,
    customer_id INTEGER,
    staff_id INTEGER
);
""")

# Insert sample data into customer
cursor.execute("INSERT INTO customer VALUES (1, 'Mary', 'Smith', 'mary.smith@example.com', 1);")
cursor.execute("INSERT INTO customer VALUES (2, 'Patricia', 'Johnson', 'patricia.johnson@example.com', 2);")
cursor.execute("INSERT INTO customer VALUES (3, 'Linda', 'Williams', 'linda.williams@example.com', 3);")


# Insert sample data into rental (with more than 2 rentals for some customers)
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27', 101, 1, 1);") # Mary
cursor.execute("INSERT INTO rental VALUES (2, '2023-10-28', 102, 2, 1);") # Patricia
cursor.execute("INSERT INTO rental VALUES (3, '2023-10-28', 103, 1, 2);") # Mary
cursor.execute("INSERT INTO rental VALUES (4, '2023-10-29', 104, 3, 1);") # Linda
cursor.execute("INSERT INTO rental VALUES (5, '2023-10-29', 105, 1, 1);") # Mary (more than 2 rentals)
cursor.execute("INSERT INTO rental VALUES (6, '2023-10-30', 106, 2, 2);") # Patricia


# Create a CTE to list customers who have made more than two rentals,
# and then join this CTE with the customer table to retrieve additional customer details.
cursor.execute("""
WITH FrequentRenters AS (
    SELECT
        customer_id,
        COUNT(rental_id) AS total_rentals
    FROM rental
    GROUP BY customer_id
    HAVING COUNT(rental_id) > 2
)
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    c.email,
    fr.total_rentals
FROM FrequentRenters fr
INNER JOIN customer c
    ON fr.customer_id = c.customer_id
ORDER BY fr.total_rentals DESC;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Customers who have made more than two rentals:")
    for row in results:
        print(row)
else:
    print("No customers found who have made more than two rentals.")

# Close the connection
conn.close()

Customers who have made more than two rentals:
(1, 'Mary', 'Smith', 'mary.smith@example.com', 3)

**Q10. CTE for Date Calculations:**

 a. Write a query using a CTE to find the total number of rentals made each month, considering the

 rental_date from the rental Table.

In [27]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy rental table with sample data
cursor.execute("""
CREATE TABLE rental (
    rental_id INTEGER PRIMARY KEY,
    rental_date TEXT NOT NULL -- Use TEXT for date strings in SQLite
);
""")

# Insert some sample data with date strings
cursor.execute("INSERT INTO rental VALUES (1, '2023-10-27');")
cursor.execute("INSERT INTO rental VALUES (2, '2023-11-15');")
cursor.execute("INSERT INTO rental VALUES (3, '2024-01-05');")
cursor.execute("INSERT INTO rental VALUES (4, '2023-10-29');")
cursor.execute("INSERT INTO rental VALUES (5, '2023-11-20');")


# Write a query using a CTE to find the total number of rentals made each month
cursor.execute("""
WITH MonthlyRentals AS (
    SELECT
        strftime('%Y-%m', rental_date) AS rental_month, -- Use strftime for SQLite
        COUNT(*) AS total_rentals
    FROM rental
    GROUP BY strftime('%Y-%m', rental_date) -- Use strftime for SQLite
)
SELECT *
FROM MonthlyRentals
ORDER BY rental_month;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Total rentals per month:")
    for row in results:
        print(row)
else:
    print("No rental data found.")

# Close the connection
conn.close()

Total rentals per month:
('2023-10', 2)
('2023-11', 2)
('2024-01', 1)

**Q11. CTE and Self-Join:**

 a. Create a CTE to generate a report showing pairs of actors who have appeared in the same film together, using the film_actor table.

In [29]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create dummy tables and insert sample data
cursor.execute("""
CREATE TABLE actor (
    actor_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45)
);
""")

cursor.execute("""
CREATE TABLE film_actor (
    actor_id INTEGER,
    film_id INTEGER,
    PRIMARY KEY (actor_id, film_id),
    FOREIGN KEY (actor_id) REFERENCES actor(actor_id)
    -- FOREIGN KEY (film_id) REFERENCES film(film_id) -- Film table not needed for this query
);
""")

# Insert sample data into actor
cursor.execute("INSERT INTO actor VALUES (1, 'Penelope', 'Guiness');")
cursor.execute("INSERT INTO actor VALUES (2, 'Nick', 'Wahlberg');")
cursor.execute("INSERT INTO actor VALUES (3, 'Ed', 'Chase');")
cursor.execute("INSERT INTO actor VALUES (4, 'Jennifer', 'Davis');")


# Insert sample data into film_actor
cursor.execute("INSERT INTO film_actor VALUES (1, 101);") # Penelope in Film 101
cursor.execute("INSERT INTO film_actor VALUES (2, 101);") # Nick in Film 101
cursor.execute("INSERT INTO film_actor VALUES (3, 102);") # Ed in Film 102
cursor.execute("INSERT INTO film_actor VALUES (1, 102);") # Penelope in Film 102


# Create a CTE to generate a report showing pairs of actors who have appeared in the same film together
cursor.execute("""
WITH ActorPairs AS (
    SELECT
        fa1.film_id,
        fa1.actor_id AS actor1_id,
        fa2.actor_id AS actor2_id
    FROM film_actor fa1
    JOIN film_actor fa2
        ON fa1.film_id = fa2.film_id
       AND fa1.actor_id < fa2.actor_id   -- avoid duplicates & self-pairs
)
SELECT
    ap.film_id,
    a1.first_name || ' ' || a1.last_name AS actor1_name, -- Use || for string concatenation in SQLite
    a2.first_name || ' ' || a2.last_name AS actor2_name  -- Use || for string concatenation in SQLite
FROM ActorPairs ap
JOIN actor a1 ON ap.actor1_id = a1.actor_id
JOIN actor a2 ON ap.actor2_id = a2.actor_id
ORDER BY ap.film_id, actor1_name, actor2_name;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Pairs of actors who have appeared in the same film:")
    for row in results:
        print(row)
else:
    print("No actor pairs found in the same film.")

# Close the connection
conn.close()

Pairs of actors who have appeared in the same film:
(101, 'Penelope Guiness', 'Nick Wahlberg')
(102, 'Penelope Guiness', 'Ed Chase')

**Q12. CTE for Recursive Search:**

 a. Implement a recursive CTE to find all employees in the staff table who report to a specific manager,

 considering the reports_to column

In [31]:
import sqlite3

# Connect to an in-memory SQLite database for demonstration
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a dummy staff table with sample hierarchical data
cursor.execute("""
CREATE TABLE staff (
    staff_id INTEGER PRIMARY KEY,
    first_name VARCHAR(45),
    last_name VARCHAR(45),
    reports_to INTEGER, -- ID of the manager this staff member reports to
    FOREIGN KEY (reports_to) REFERENCES staff(staff_id)
);
""")

# Insert sample data (creating a simple hierarchy)
cursor.execute("INSERT INTO staff VALUES (1, 'Manager', 'One', NULL);") # Top-level manager
cursor.execute("INSERT INTO staff VALUES (2, 'Supervisor', 'A', 1);") # Reports to Manager One
cursor.execute("INSERT INTO staff VALUES (3, 'Employee', 'X', 2);")    # Reports to Supervisor A
cursor.execute("INSERT INTO staff VALUES (4, 'Employee', 'Y', 2);")    # Reports to Supervisor A
cursor.execute("INSERT INTO staff VALUES (5, 'Supervisor', 'B', 1);") # Reports to Manager One
cursor.execute("INSERT INTO staff VALUES (6, 'Employee', 'Z', 5);")    # Reports to Supervisor B


# Implement a recursive CTE to find all employees reporting to a specific manager
cursor.execute("""
WITH RECURSIVE StaffHierarchy AS (
    -- Anchor: start with the chosen manager (example: staff_id = 1)
    SELECT
        staff_id,
        first_name,
        last_name,
        reports_to
    FROM staff
    WHERE staff_id = 1   -- Change this ID to select a different manager

    UNION ALL

    -- Recursive step: find employees reporting to those in hierarchy
    SELECT
        s.staff_id,
        s.first_name,
        s.last_name,
        s.reports_to
    FROM staff s
    INNER JOIN StaffHierarchy sh
        ON s.reports_to = sh.staff_id
)
SELECT *
FROM StaffHierarchy;
""")

# Fetch and display the results
results = cursor.fetchall()

if results:
    print("Staff Hierarchy (reporting to the selected manager):")
    for row in results:
        print(row)
else:
    print("No staff found reporting to the selected manager.")

# Close the connection
conn.close()

Staff Hierarchy (reporting to the selected manager):
(1, 'Manager', 'One', None)
(2, 'Supervisor', 'A', 1)
(5, 'Supervisor', 'B', 1)
(3, 'Employee', 'X', 2)
(4, 'Employee', 'Y', 2)
(6, 'Employee', 'Z', 5)